{"id":"3auKdN6FdQE2gne1WWwLu8rD5W5KkACt3BG5wnajBjmRoyS8FoCcERRywcPSjC","title":"Eh Sayers","displayTitle":"Eh Sayers","url":"https://feeds.transistor.fm/statcan-eh-sayers","feedLink":"http://www.statcan.gc.ca/en/sc/podcasts","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Mapping Happiness: How Where We Live Impacts Our Well-Being","url":"https://share.transistor.fm/s/a1bbe7b5","date":1738148400,"author":"Statistics Canada","guid":42,"unread":true,"content":"<p>It might not surprise you that your relationships with friends and family affect your well-being. Same with your health and your job. But what about the place where you live? Whether you live in the downtown core of a major city or a commuter town or a rural community, what impact does this have on your life satisfaction, loneliness and sense of belonging? StatCan’s Lauren Pinault joins us today at the mic to explore how the places we live affect our well-being. </p>","contentLength":469,"flags":null,"enclosureUrl":"https://media.transistor.fm/a1bbe7b5/434fcb01.mp3","enclosureMime":"","commentsUrl":null},{"title":"Can Your Business Outsmart a Hacker?","url":"https://share.transistor.fm/s/fbacf553","date":1732791600,"author":"Statistics Canada","guid":41,"unread":true,"content":"<p>Over two thirds (70%) of Canadians experienced a cyber security incident in 2022. The strategies used by bad actors are getting more and more complex. Many of us are inundated with what feels like never-ending phishing emails, scam text messages and fraudulent phone calls. It’s rare to talk to someone who hasn’t experienced some form of a cyber attack.&nbsp;</p><p>The situation is no different for Canadian businesses. Identity theft, scams, fraud, and ransomware are only some of the ways cyber attackers are targeting businesses today. One cyber security breach can cost a business thousands of dollars and valuable time resources to neutralize. We wanted to know: Is cyber crime on the rise in Canada? What is the relatively new phenomenon of cyber risk insurance? And in what way are consumers affected when a business experiences a security breach?&nbsp;</p><p>The Canadian Survey of Cyber Security and Cyber Crime has published new data and, in this episode, we sat down with Howard Bilodeau, an economist at Statistics Canada to answer our questions about how cyber security is changing for businesses and what it means for the rest of us. &nbsp;</p>","contentLength":1134,"flags":null,"enclosureUrl":"https://media.transistor.fm/fbacf553/05be7b1a.mp3","enclosureMime":"","commentsUrl":null},{"title":"Is AI Coming For Your Job?","url":"https://share.transistor.fm/s/8b36bff9","date":1727949600,"author":"Statistics Canada","guid":40,"unread":true,"content":"<p>AI is here and it’s here to stay. Apps like ChatGPT are now allowing us to perform complex tasks with the click of a button. &nbsp;</p><p>As we begin to use these new versions of AI, our jobs are destined to change. So, what will an average day of work look like a decade from now? Which jobs will AI impact the most? And is AI coming to replace our jobs altogether?&nbsp; &nbsp;</p><p>In this episode, we sat down with AI expert Tahsin Mehdi, an economist in the social analysis and modeling division of Statistics Canada, to answer our questions about how AI will transform our work lives in Canada.&nbsp;</p>","contentLength":579,"flags":null,"enclosureUrl":"https://media.transistor.fm/8b36bff9/074edef7.mp3","enclosureMime":"","commentsUrl":null},{"title":"Why Economists Are Sounding the Alarm on Productivity","url":"https://share.transistor.fm/s/7b2071ff","date":1722247200,"author":"Statistics Canada","guid":39,"unread":true,"content":"<p>Canada’s workforce is among the most educated in the world. But when it comes to worker productivity, we’ve seen a real slump over the past few years. The quarterly data published by StatCan in June 2024 confirms Canadian workers are continuing to underperform compared to our neighbours to the south. This comes as no surprise to this episode’s guest, Guy Gellatly, Chief Economic Advisor at StatCan. The latest quarterly numbers are a continuation of an on-going decline in Canada’s productivity that economists have been tracking for years. &nbsp;</p><p>But what factors influence worker productivity? And why does it matter if Canadians are less productive? As a matter of fact, what even  productivity? In this episode, we asked Guy to help us understand how we got to this point and why it matters for Canadians. &nbsp;</p>","contentLength":818,"flags":null,"enclosureUrl":"https://media.transistor.fm/7b2071ff/7f86ea5b.mp3","enclosureMime":"","commentsUrl":null},{"title":"It's Not Easy Bein' Green","url":"https://share.transistor.fm/s/54f7dce8","date":1717664400,"author":"Statistics Canada","guid":38,"unread":true,"content":"<p>We can try our best, but its not always easy knowing what's best for the environment. The world is complicated, and it isn't as simple as reduce, reuse, recycle—though that's a great place to start!In the immortal words of Kermit the Frog, \"It's not easy bein' green.\"<p>We have two stories exploring that theme. The first is one we made in-house asking just how green our digital world really is, and the second comes from the Simply Science podcast exploring the world of urban forests.</p></p>","contentLength":487,"flags":null,"enclosureUrl":"https://media.transistor.fm/54f7dce8/a10b6988.mp3","enclosureMime":"","commentsUrl":null},{"title":"Why Food Inflation Is Such a Hard Nut to Crack","url":"https://share.transistor.fm/s/97b2d26e","date":1715158800,"author":"Statistics Canada","guid":37,"unread":true,"content":"<p>Are you feeling like it's a little bit harder to bring home the bacon... from the grocery store? The latest data indicate that food prices have mostly stabilized... but why does it feel like the cost of feeding your family is still going up?</p><p>Today we're talking food inflation with StatCan's resident smart cookie Taylor Mitchell.</p>","contentLength":329,"flags":null,"enclosureUrl":"https://media.transistor.fm/97b2d26e/2f703e92.mp3","enclosureMime":"","commentsUrl":null},{"title":"It's 8 pm...Do You Know What Your Kids Are Googling?","url":"https://share.transistor.fm/s/8710dcf9","date":1712635320,"author":"Statistics Canada","guid":36,"unread":true,"content":"<p>StatCan released new analysis into the online culture our kids are growing up in, and it’s far from the best of all possible worlds: misinformation, bullying, violence… and worse.</p><p>Analyst Rachel Tsitomeneas joins us to dive into the findings.&nbsp;</p>","contentLength":247,"flags":null,"enclosureUrl":"https://media.transistor.fm/8710dcf9/cb577436.mp3","enclosureMime":"","commentsUrl":null},{"title":"How Do You Say \"Language Revitalization\" in Cree?","url":"https://share.transistor.fm/s/bd75c457","date":1710842400,"author":"Statistics Canada","guid":35,"unread":true,"content":"<p>More than 70 distinct Indigenous languages are spoken by First Nations people, Métis and Inuit in Canada, but these languages are under threat.&nbsp;</p><p>In this episode, we speak with Randy Morin and Belinda kakiyosēw Daniels, who share their knowledge of the Cree language with learners at the Nêhiyawak Language Experience, about the wisdom encoded in Indigenous languages, as well as the opportunities for these languages and the barriers they face.&nbsp;</p>","contentLength":449,"flags":null,"enclosureUrl":"https://media.transistor.fm/bd75c457/f67c653e.mp3","enclosureMime":"","commentsUrl":null}],"tags":[]}