{"id":"3auKdN6FdQE2gne1WWwLu8rD5W5KkACt3BG5wnajhsRKzXRwXoZceCKpujq2ub","title":"The First Sixteen","displayTitle":"The First Sixteen","url":"https://feeds.transistor.fm/the-first-sixteen","feedLink":"https://agriculture.canada.ca/en/agri-info/first-sixteen-podcast","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Women farmers leading into the future","url":"https://share.transistor.fm/s/27b48ed8","date":1770813798,"author":"Agriculture and Agri-food Canada","guid":72,"unread":true,"content":"<p>2026 is the International Year of the Woman Farmer.&nbsp; Women are changing the face of farming in Canada. They are highly educated. They’re working hard. And, while they are having success, they also encounter unique barriers to entry and advancement in the sector. This episode speaks with two women from the Prairies who are at the vanguard of this movement. Learn how they are breaking down barriers. Hear their vision for the future of agriculture in Canada.</p>","contentLength":462,"flags":null,"enclosureUrl":"https://media.transistor.fm/27b48ed8/eb1658f7.mp3","enclosureMime":"","commentsUrl":null},{"title":"More Than a Transaction: Reimagining Farm Transitions","url":"https://share.transistor.fm/s/f54d619d","date":1766427910,"author":"Agriculture and Agri-food Canada","guid":71,"unread":true,"content":"<p>Farm transitions aren’t simply business deals — they’re deeply human and often emotionally complex. In this episode, we speak with two innovators reimagining how farms change hands and how new farmers find their place. Heather Watson, Executive Director of Farm Management Canada, brings a national view on business planning, succession, and the changing realities of farm ownership. Sara Dent, co-founder of Young Agrarians, is creating new pathways into farming — helping aspiring producers find land, mentors, and community.</p>","contentLength":535,"flags":null,"enclosureUrl":"https://media.transistor.fm/f54d619d/a28c3fd4.mp3","enclosureMime":"","commentsUrl":null},{"title":"From Fences to Firewalls: Cyber security in agriculture","url":"https://share.transistor.fm/s/00521957","date":1760557813,"author":"Agriculture and Agri-food Canada","guid":70,"unread":true,"content":"<p>From phones and computers to automated systems in barns and data collection in harvesters, each piece of technology on a farm is a fantastic tool – and a potential weak point. And hackers look for – weak points. Just as producers protect livestock and crops from predators, they need to do the same to protect their technology. In this episode, Dr. Ali Dehghantanha, Canada Research Chair in cyber security at the University of Guelph, explains how producers can stay a few simple and innovative steps ahead of the criminals.&nbsp; And Charles-Félix Ross, Director General of Quebec’s UPA, shares what happened when his organization was hit by ransomware and the key lessons learned.&nbsp; Learn more about the <a href=\"https://can01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fagriculture.agr.gc.ca%2Fen%2Fprograms%2Ftools-manage-farm-risk-and-finance%2Fcyber-security-and-your-farming-business&amp;data=05%7C02%7Cjoseph.pauls%40agr.gc.ca%7Ca2ed2513bb784770fccc08de0c239f24%7C9da98bb118574cc387519a49e35d24cd%7C0%7C0%7C638961544330557311%7CUnknown%7CTWFpbGZsb3d8eyJFbXB0eU1hcGkiOnRydWUsIlYiOiIwLjAuMDAwMCIsIlAiOiJXaW4zMiIsIkFOIjoiTWFpbCIsIldUIjoyfQ%3D%3D%7C0%7C%7C%7C&amp;sdata=ZkrlXeFHAh4oaVXJI2p%2BAPzXWXSSSNBrh680Y582dc4%3D&amp;reserved=0\">Toolkit</a>.</p>","contentLength":718,"flags":null,"enclosureUrl":"https://media.transistor.fm/00521957/94b9e5e2.mp3","enclosureMime":"","commentsUrl":null},{"title":"Opening new markets in the Indo-Pacific","url":"https://share.transistor.fm/s/a0b844c2","date":1752676436,"author":"Agriculture and Agri-food Canada","guid":69,"unread":true,"content":"<p>How do we open new markets in diverse and dynamic countries? What challenges do we face, and what solutions are being used? Chris White, President and CEO of the Canadian Meat Council, and Diedrah Kelly, Executive Director of the Indo-Pacific Agriculture and Agri-Food Office in Manila, share their insights. From building strong trade relationships to promoting Canada’s trusted brand, this episode explores the work needed to grow Canada’s presence in one of the world’s fastest-growing regions.</p>","contentLength":503,"flags":null,"enclosureUrl":"https://media.transistor.fm/a0b844c2/c4172f3a.mp3","enclosureMime":"","commentsUrl":null},{"title":"Innovative investments: Venture capital funding in agriculture and food","url":"https://share.transistor.fm/s/b853f6d5","date":1750263583,"author":"Agriculture and Agri-food Canada","guid":68,"unread":true,"content":"<p>Innovators take risks. And they need investors who are willing and informed to help them take the risks.&nbsp; Alison Sunstrum is a pioneering entrepreneur turned investor, now on a mission to fix the gaps she once faced—mentorship and access to capital—by investing in exceptional talent and bold ideas in agriculture. Graeme is part of the team at FCC Capital, which is a new effort from Farm Credit Canada to provide what he calls 'patient, and reliable capital' to agri-food and ag-tech companies across the country. Hear how these two and their teams are filling an important funding gap in Canada to help innovation in the ag sector.&nbsp; &nbsp;</p>","contentLength":644,"flags":null,"enclosureUrl":"https://media.transistor.fm/b853f6d5/b2920555.mp3","enclosureMime":"","commentsUrl":null},{"title":"On Farm Climate Action in Action","url":"https://share.transistor.fm/s/c84383ee","date":1748889023,"author":"Agriculture and Agri-food Canada","guid":67,"unread":true,"content":"<p>Farmers are taking action to protect the environment and strengthen the competitiveness of our agricultural sector. We speak with three producers who are leaders in reducing greenhouse gases, sequestering carbon, and building resilience against climate change. With support from the On-Farm Climate Action Fund (OFCAF), they’ve adopted beneficial management practices (BMPs) that make good business sense. Tune in to hear their insights and advice for fellow producers.</p>","contentLength":471,"flags":null,"enclosureUrl":"https://media.transistor.fm/c84383ee/4728d47b.mp3","enclosureMime":"","commentsUrl":null}],"tags":[]}