{"id":"3auKdN6FdQE2gne1WWwLu8rD5W5KkACt3BG5wnajBjmRoyS8FoCcERRywcPSjC","title":"Eh Sayers","displayTitle":"Eh Sayers","url":"https://feeds.transistor.fm/statcan-eh-sayers","feedLink":"http://www.statcan.gc.ca/en/sc/podcasts","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":7,"items":[{"title":"GDP Explained Without Putting You to Sleep (We Promise!)","url":"https://share.transistor.fm/s/a6d79eb5","date":1767884400,"author":"Statistics Canada","guid":83,"unread":true,"content":"<p>The Gross Domestic Product (GDP) tells us about the health and size of Canada’s economy. But for those of us who don’t own or operate multi-million-dollar companies, why does it matter at all? In this episode, Amanda Sinclair, Assistant director for the National Economic Accounts at Statistics Canada, explains some surprising ways GDP can be useful and why, for certain Canadian households, the numbers don’t always seem to add up.</p>","contentLength":439,"flags":null,"enclosureUrl":"https://media.transistor.fm/a6d79eb5/67a1e5f0.mp3","enclosureMime":"","commentsUrl":null},{"title":"A Christmas Tree Trivia Showdown","url":"https://share.transistor.fm/s/8baaa9f7","date":1765364400,"author":"Statistics Canada","guid":82,"unread":true,"content":"<p>Think your Christmas tree knowledge is top‑notch? Time to put it to the test!</p><p>In this holiday special of Eh Sayers, our colleagues face off in a trivia showdown all about Canada’s Christmas tree industry.</p><p>Discover which nation first sparked the tradition, how much Canadian Christmas tree farmers earned in 2023, the surprising numbers behind exports and imports, and more festive facts.</p><p>After listening, you’ll be the go‑to expert on Christmas trees at your holiday party!</p>","contentLength":478,"flags":null,"enclosureUrl":"https://media.transistor.fm/8baaa9f7/daad8ffa.mp3","enclosureMime":"","commentsUrl":null},{"title":"Screens Replaced Play, and Our Bodies Noticed","url":"https://share.transistor.fm/s/ba358e47","date":1763031600,"author":"Statistics Canada","guid":81,"unread":true,"content":"<p>Has Canada become a sedentary nation?&nbsp;</p><p>Health data have never been more accessible. We have smart watches to count our steps, notifications about our screen times and apps to track our daily diets.&nbsp;</p><p>Despite the futuristic tech, researchers are growing concerned. And they’re especially concerned about young Canadians.</p><p>Today we sat down with Rachel Colley, a senior health researcher at StatCan for a deep dive into Canada’s obesity, physical activity and screen time trends. And the new data from the Canadian Health Measures survey may surprise you. </p>","contentLength":555,"flags":null,"enclosureUrl":"https://media.transistor.fm/ba358e47/8056776c.mp3","enclosureMime":"","commentsUrl":null},{"title":"Canadians Just Aren't California Dreamin' These Days","url":"https://share.transistor.fm/s/0e051e5c","date":1754989200,"author":"Statistics Canada","guid":80,"unread":true,"content":"<p>Calllllll-i-forrrrr-nia... here we come?</p><p>&nbsp;If you've changed your plans to visit the US recently, you're not alone. Nowadays, Canadians are more likely to be singing along to \"Bobcaygeon\" than \"Sweet Home Alabama.\"</p><p>Today, we're sitting down with Jane Lin, of the Tourism Statistics Program at Statistics Canada, to dig into StatCan's tourism data and talk about how travel is different these days.</p>","contentLength":395,"flags":null,"enclosureUrl":"https://media.transistor.fm/0e051e5c/d6563af3.mp3","enclosureMime":"","commentsUrl":null},{"title":"A Tariff on Both Your Houses","url":"https://share.transistor.fm/s/2d57cae0","date":1752573600,"author":"Statistics Canada","guid":79,"unread":true,"content":"<p>Two countries, both alike in dignity,&nbsp;</p><p>In North America, where we lay our scene,&nbsp;</p><p>From ancient friendship break to new trade tragedy,&nbsp;</p><p>Of data on trade and tariffs, what might we glean?&nbsp;</p><p>Join us as we speak with Guy Gellatly, Chief Economic Advisor, at Statistics Canada, as we explore what’s been going on with trade with our closest neighbour, what the early numbers suggest about the conflict, and what impact it might have on Canada’s economy.&nbsp;</p>","contentLength":453,"flags":null,"enclosureUrl":"https://media.transistor.fm/2d57cae0/2e002be4.mp3","enclosureMime":"","commentsUrl":null},{"title":"Losing Our Religion? It's Not That Simple","url":"https://share.transistor.fm/s/b3bb6fe2","date":1746525600,"author":"Statistics Canada","guid":78,"unread":true,"content":"<p>Is that Canada in the corner? In the spotlight? Are we losing our religion?<p>&nbsp;The census found that 12.6 million people reported no religious affiliation in 2021, more than 1/3 of Canada's population. But is there more to the picture?</p><p>&nbsp;With guests Simon-Pierre Lacasse, Senior Analyst at StatCan, and Sarah Wilkins-Laflamme, Associate Professor at the University of Waterloo, we're exploring what's driving this trend, whether \"no religion\" means \"no spirituality,\" and how the story varies from spiritual British Columbia to the cultural Catholicism of Quebec to the freshly painted churches of Atlantic Canada.&nbsp;</p></p>","contentLength":613,"flags":null,"enclosureUrl":"https://media.transistor.fm/b3bb6fe2/63821fcd.mp3","enclosureMime":"","commentsUrl":null},{"title":"What Does It Take to Exit Homelessness?","url":"https://share.transistor.fm/s/2383792c","date":1741600800,"author":"Statistics Canada","guid":77,"unread":true,"content":"<p>What is it that helps someone transition from homeless to housed? We’re looking at new analysis of data from the Canadian Housing Survey to explore exactly that. In conversation with Peter Tilley, the CEO of the Ottawa Mission, and Jeff Randle, Chief of the Housing Need Project section at Statistics Canada, we’re asking why homelessness (and homelessness data!) is more complex than you might think, what factors most often led to regaining housing, and why housing can be challenging to maintain even after it’s been regained.&nbsp;</p>","contentLength":537,"flags":null,"enclosureUrl":"https://media.transistor.fm/2383792c/75fb7f6c.mp3","enclosureMime":"","commentsUrl":null}],"tags":[]}