{"id":"3auKdN6FdQE2gne1WWwLu8rD5W5KkACt3BG5wnajhsRKzXRwXoZceCKpujq2ub","title":"The First Sixteen","displayTitle":"The First Sixteen","url":"https://feeds.transistor.fm/the-first-sixteen","feedLink":"https://agriculture.canada.ca/en/agri-info/first-sixteen-podcast","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"Calculating crop rotation for potatoes","url":"https://share.transistor.fm/s/7f67f1c9","date":1737550167,"author":"Agriculture and Agri-food Canada","guid":84,"unread":true,"content":"<p>Lori Robinson, a 6 generation farmer in PEI, is a data hound.&nbsp; As a result of her 50+ years of her and her family taking detailed notes and 20 + years of doing a four-year crop rotation system she laid the groundwork for a user-friendly calculator for crop rotations that has both economic benefits for producers and environmental benefits. Developed at the Living Labs initiative in PEI in conjunction with the PEI Potato Board, the calculator helps producers maximize profits while reducing their use of pesticides and improving soil health. And the story of the calculator has some interesting twists.</p>","contentLength":605,"flags":null,"enclosureUrl":"https://media.transistor.fm/7f67f1c9/99d2a32e.mp3","enclosureMime":"","commentsUrl":null},{"title":"Plant breeding: Long-game innovation in a fast-changing world","url":"https://share.transistor.fm/s/c0465e78","date":1733920377,"author":"Agriculture and Agri-food Canada","guid":83,"unread":true,"content":"<p>How has plant breeding evolved over the past 20 years? Who are the players in Canada? What is the plant breeding continuum? And what is the proverbial sandbox in which Canadian plant breeders are working? Learn this and why it takes a special breed of innovator to become a plant-breeder.&nbsp;</p>","contentLength":290,"flags":null,"enclosureUrl":"https://media.transistor.fm/c0465e78/ea335723.mp3","enclosureMime":"","commentsUrl":null},{"title":"Science vs. food waste","url":"https://share.transistor.fm/s/7f8e0c6e","date":1718355600,"author":"Agriculture and Agri-food Canada","guid":82,"unread":true,"content":"<p>Can we make biodegradable plastics using food waste? Can we control disease in crops and eliminate food borne pathogens using just hydrogen peroxide, ozone and UV rays? Yes, we can! Meet the two grand prize winners of the Food Waste Reduction Challenge – in the novel technology stream -- who proved we can do this and more.&nbsp;</p><p>Learn how Genecis Bioindustries and Clean Works are fighting food waste and food loss with cutting-edge science.&nbsp;</p>","contentLength":442,"flags":null,"enclosureUrl":"https://media.transistor.fm/7f8e0c6e/41a008b7.mp3","enclosureMime":"","commentsUrl":null},{"title":"Challenge accepted!","url":"https://share.transistor.fm/s/0a6bab0c","date":1714393254,"author":"Agriculture and Agri-food Canada","guid":81,"unread":true,"content":"<p>Announcing the two winners of the Food Waste Reduction Challenge (Business Models Stream)</p><p>Two companies took away $1.5 M! Find out who they are. Learn what it took to become the winners of the challenge, and leaders in this new sub-sector. The funds will help the winning companies further expand their success in fighting food waste and reducing greenhouse gases.&nbsp; And, we’ll give you a glimpse behind the scenes with Dr Jean-Charles Le Vallée, who will share insights into being a jury member of the challenge.&nbsp;</p>","contentLength":517,"flags":null,"enclosureUrl":"https://media.transistor.fm/0a6bab0c/8897684b.mp3","enclosureMime":"","commentsUrl":null},{"title":"Is that a robot in your field?","url":"https://share.transistor.fm/s/a5bf9d8e","date":1710320400,"author":"Agriculture and Agri-food Canada","guid":80,"unread":true,"content":"<p>Ag-robotics specialists Chuck Baresich believes you’ll have a robot in your field sooner than you think.&nbsp; What will they do? How will they add value to your farm? Chuck paints a picture of that future. And what is the government doing to help the agricultural sector be ready for those robots? Marco Valicenti, Director General of Innovation Programs Directorate and Brett Maxwell, Director of Strategic Policy Branch explain how Agriculture and Agri-Food Canada’s programs are enabling that future.</p>","contentLength":504,"flags":null,"enclosureUrl":"https://media.transistor.fm/a5bf9d8e/3ef448b2.mp3","enclosureMime":"","commentsUrl":null}],"tags":[]}