{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZUrxgZ6XNcyUn6fFxkgS1aSWJWwPwaqFp34erWr8NxVvd6jro8uiaPvDUjw","title":"top scoring links : kubernetes","displayTitle":"Reddit - Kubernetes","url":"https://www.reddit.com/r/kubernetes/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/kubernetes/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Using Terraform to deploy an ML orchestration system in EKS in minutes","url":"https://www.reddit.com/r/kubernetes/comments/1in4ad3/using_terraform_to_deploy_an_ml_orchestration/","date":1739295501,"author":"/u/Old-Cartographer3050","guid":372,"unread":true,"content":"<p>If you're looking to get started or migrate to an open source ML orchestration solution that integrates natively with Kubernetes, look no further.</p><p>Flyte delivers a Python SDK that abstracts away the K8s inner workings but gives users easy access to compute resources (including accelerators), Secrets, and more; enabling reproducibility, versioning, and parallelism for complex ML workflows.</p><p>We developed a reference implementation for EKS that's fully automated with Terraform/OpenTofu.</p><p>(Disclaimer: I'm a Flyte maintainer)</p>","contentLength":521,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"KubeCon Europe","url":"https://www.reddit.com/r/kubernetes/comments/1in1hyg/kubecon_europe/","date":1739288588,"author":"/u/Major-Bug-6518","guid":374,"unread":true,"content":"<p>Any of you guys planning to attend in April? </p><p>For those who were able to join in the previous events, what was the best parts of it?</p><p>Any advice for a first timer like me? </p>","contentLength":169,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"[ Removed by Reddit ]","url":"https://www.reddit.com/r/kubernetes/comments/1in06ix/removed_by_reddit/","date":1739285161,"author":"/u/wakenbaker55","guid":371,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/wakenbaker55\"> /u/wakenbaker55 </a>","contentLength":35,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Canonical announces 12 year Kubernetes LTS. This is huge!","url":"https://canonical.com/blog/12-year-lts-for-kubernetes","date":1739282168,"author":"/u/Unlucky_Armadillo959","guid":376,"unread":true,"content":"<p><strong>Canonical’s Kubernetes LTS (Long Term Support) will support FedRAMP compliance and receive at least 12 years of committed security maintenance and enterprise support on bare metal, public clouds, OpenStack, Canonical MicroCloud and VMware.</strong></p><p> Today, Canonical announced a 12 year security maintenance and support commitment starting with&nbsp; Kubernetes 1.32. The new release is easy to install, operate and upgrade, with best-of-breed open source networking, DNS, gateway, metrics server, local storage, load balancer and ingress services. Canonical Kubernetes enables customers to upgrade at their own pace, with new upstream releases every four months for organizations that prefer to move fast, and a 12 year commitment for organizations that need long-term supported environments.</p><p>“Constant Kubernetes upgrades are a drain on enterprise teams. Customers who deploy Canonical Kubernetes 1.32 LTS can focus on the future, because their clusters will receive security updates for 12 full years,” said Mark Shuttleworth. “Combined with Ubuntu Pro , which covers the widest range of open source applications, the entire open source stack can now be operated with greater confidence and simpler compliance to hardening standards like FedRAMP. From the public cloud to the data center to the edge, on servers and workstations and connected devices, we are excited to deliver a simple ‘deploy-and-move-forward’ approach to enterprise grade containers that keeps the business focus on applications and innovation rather than infrastructure.”</p><p>Canonical Kubernetes is a multi-cloud distribution that provides a unified production-grade Kubernetes experience for developer workstations, cloud, data centers and edge deployments. Future releases of MicroK8s and Charmed Kubernetes will build on Canonical Kubernetes and also gain the 12 year LTS. Customers will also be able to orchestrate their Kubernetes clusters using standalone Canonical Kubernetes LTS binaries and container images, with full enterprise support from Canonical.&nbsp;</p><h3>Long term support and latest upstream Kubernetes</h3><p>The upstream Kubernetes release cycle is fast-paced, with a new version every four months and security maintenance provided for 14 months. Frequent Kubernetes version upgrades disrupt business continuity and require time-consuming and expensive maintenance. At the same time, the pace of innovation in Kubernetes makes newer versions attractive for developers and new deployments.</p><p>Canonical will provide interim releases of its Kubernetes packages every four months, aligned with the upstream Kubernetes release cadence and versions. These interim releases will be security maintained and supported for 14 months, with upgrade paths from release to release.</p><p>Like Ubuntu, Canonical will release LTS packages of Kubernetes every two years, starting with Canonical Kubernetes 1.32 LTS. With an Ubuntu Pro subscription, these LTS releases will get CVE security fixes for at least 12 years. Thereafter, Canonical will continue to support and patch these releases of Kubernetes based on customer needs for extremely long-lived deployments in telecommunications and other critical infrastructure.</p><p>In this way, Canonical’s packaging and LTS commitment to Kubernetes enables both rapid acquisition of the latest upstream for fast-moving deployments and developers, and long term maintenance for production deployments that need to remain stable for many years.&nbsp;</p><h3>Best-of-breed open source</h3><p>Canonical Kubernetes ships with best-of-breed open source components for essential functions and uses only standard Kubernetes abstractions and APIs to achieve full Kubernetes conformance. This enables the platform to evolve to newer implementations with minimal user disruption. Canonical Kubernetes 1.32 LTS will provide Cilium, MetalLB, CoreDNS, OpenEBS and Metrics Server by default. Customers can replace these components in the rare cases they need to do so, and the Canonical-provided elements will still be supported.</p><p>Canonical will also provide standardized container images of popular Kubernetes ecosystem services such as Istio, Cert Manager or OpenTelemetry Collector – also with a 12 year security and support commitment. Customers can request additional open source components to be added to this Kubernetes ecosystem portfolio through the <a href=\"https://canonical.com/blog/canonical-offers-12-year-lts-for-any-open-source-docker-image\">Everything LTS</a> offering.</p><h3>Easy to install and operate across environments</h3><p>DevOps teams often use different Kubernetes distributions or versions across the application development and deployment lifecycle. As workloads move from development to test to production, any difference between those environments is a source of friction, cost, and mistakes.</p><p>Canonical Kubernetes offers a simple low-touch operational approach across the entire software lifecycle. The same package provides the same APIs on developer workstation environments, small clusters, and even larger, more complex scenarios.</p><p>For single-node or smaller multi-node clusters, Canonical Kubernetes is installed with just two commands per node. These clusters will automatically update with security-only fixes for the maintenance lifetime of that version, making it an easy solution for both edge and workstation.</p><p>Canonical Kubernetes can also be orchestrated in more complex environments for custom storage, networking (including Multus for telco requirements) and GPUs for AI/ML training and model serving. It also comes with cluster lifecycle automation through Juju, with the possibility to integrate other <a href=\"https://canonical.com/solutions/infrastructure\">Canonical infrastructure</a> stack components.</p><p>“Canonical Kubernetes Platform offers the freedom to operate Kubernetes your own way,” said Marcin Stożek, Product Manager for Kubernetes at Canonical. “It enables you to choose between automatic cluster upgrades or staying on a long-term supported release for extended stability. By addressing infrastructure complexity – one of Kubernetes’ primary challenges – through reliable security maintenance, lifecycle automation, and additional open-source components, we simplify cloud-native platform operations for all users.”</p><p>Security maintenance and support for Canonical Kubernetes can be purchased with an Ubuntu Pro subscription. Learn more at <a href=\"https://ubuntu.com/pro\">https://ubuntu.com/pro</a>.</p><p>Canonical, the publisher of Ubuntu, provides open source software, security, support and services. Our portfolio covers critical systems, from the smallest devices to the largest clouds, from the kernel to containers, from databases to AI. With customers that include top tech brands, emerging startups, governments and home users, Canonical delivers trusted open source for everyone.</p>","contentLength":6590,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/kubernetes/comments/1imz3vm/canonical_announces_12_year_kubernetes_lts_this/"},{"title":"Weekly: Questions and advice","url":"https://www.reddit.com/r/kubernetes/comments/1imw1gz/weekly_questions_and_advice/","date":1739271633,"author":"/u/gctaylor","guid":373,"unread":true,"content":"<p>Have any questions about Kubernetes, related tooling, or how to adopt or use Kubernetes? Ask away!</p>","contentLength":98,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hands-on workshop: OpenTelemetry and Linkerd (this Thursday)","url":"https://www.reddit.com/r/kubernetes/comments/1imuq9x/handson_workshop_opentelemetry_and_linkerd_this/","date":1739265751,"author":"/u/mmanciop","guid":375,"unread":true,"content":"<p>if you're interested in OpenTelemetry and/or Linkerd, join the hands-on workshop I'll be co-hosting with Flynn (Linkerd) this Thursday.</p><p>We will look into OpenTelemetry and what it does, how distributed tracing and service meshes interact and complete one another, and on the support for OpenTelemetry in Linkerd, which no longer requires translating from OpenCensus (pretty neat!).</p>","contentLength":380,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit","k8s"]}