{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Professor says Canada should block U.S. ambassador while Trump talks annexation","url":"https://cheknews.ca/professor-says-canada-should-block-u-s-ambassador-while-trump-talks-annexation-1238452/","date":1739302761,"author":"/u/SilverDragon1","guid":453,"unread":true,"content":"<p>Ottawa should block Donald Trump’s chosen ambassador to Canada until the U.S. president stops questioning Canada’s sovereignty, says one expert.</p><p>“We could potentially use (this) as a way of signalling the seriousness with which the Government of Canada is viewing this unwelcome talk,” said University of Victoria international relations professor Will Greaves.</p><p>“It is an overt, aggressive policy that (Trump) seems to be shifting his administration to endorse. And if we are remotely serious as a country, we should regard that as a hostile action and embrace a wider array of tools in our response towards it.”</p><p>Prime Minister Justin Trudeau initially characterized those comments as jokes. But he told business leaders last Friday that the idea of absorbing Canada “<a href=\"https://cheknews.ca/trudeau-tells-economic-summit-trump-is-serious-about-taking-over-canada-1237868/\">is a real thing</a>” for Trump, because of Canada’s resource wealth.</p><p>Trump said Sunday that he could easily enact economic policies that “would not allow Canada to be a viable country,” such as shutting down Canada’s auto sector.</p><p>“Without the U.S., Canada doesn’t really have a country. They do almost all of their business with us,” Trump said.</p><p>The diplomatic protocols governing how countries appoint a head of mission involve making a formal request for the receiving country to accept the appointment prior to the ambassador’s arrival. Arriving ambassadors later present their formal credentials to the governor general.</p><p>Trump announced last November that he had tapped former Michigan congressman Pete Hoekstra to serve as the next American envoy to Canada.</p><p>While Hoekstra still needs to be confirmed by the U.S. Senate, Foreign Affairs Minister Mélanie Joly has welcomed him as someone who understands the importance of cross-border trade.</p><p>Greaves said the U.S. ambassador to Canada is a “patronage appointment” used by presidents to reward a key supporter with a plum post that involves overseeing an embassy whose staff do the heavy lifting of diplomatic relations.</p><p>“To reject, or not accept, the credentials of the next U.S. ambassador would be to deprive Donald Trump of that plum patronage appointment that he can give to one of his supporters,” Greaves said. “That costs him something.”</p><p>While Canada’s ambassadors in Washington sometimes have political ties, they’re generally appointed due to their diplomatic skills and have a major role in managing the country’s most important bilateral relationship.</p><p>Greaves said he came up with the idea once it became clear that Trump wasn’t going to stop talking about annexing Canada.</p><p>He said diplomacy exists to provide countries with “a way of increasing the costs” of hostile acts, without resorting to economic or military responses.</p><p>Greaves argued Canada would block the appointment of an ambassador of any other country exhibiting the same behaviour — if, for example, Russia sent an ambassador after suggesting the Canadian Arctic was actually Russian territory.</p><p>“We shouldn’t allow the fact that it’s the United States to overly colour what is an appropriate reaction under these circumstances,” he said.</p><p>Greaves said that if Trump doesn’t change his tune, Canada should seriously consider barring him from the G7 leaders’ summit, planned for mid-June in Alberta.</p><p>“Why would Canada host, as an honoured guest on its soil, the head of state of the country that is publicly, repeatedly and directly challenging our very sovereignty over the place that he would be coming to visit?” he said.</p><p>Greaves said the U.S. likely would retaliate if Canada sought to block its ambassador, but he described that as part of the “price” Canada will have to pay to fight for its sovereignty.</p><p>“That is the price of our independence, as decided by Donald Trump,” he said.</p><p>Refusal to accredit an envoy is a response reserved for serious international disputes. In Canada, it’s even more rare than expulsions of foreign diplomats.</p><p>In 2023, Joly told Parliament that Ottawa had declined to issue a diplomatic visa for “a political operative” from China because they were deeply linked to the Communist Party of China.</p><p>In 2018, Ottawa barred three of Russia’s proposed diplomats from serving in Canada, and expelled four who were already accredited to Canada, in response to the poisoning of former Russian spy Sergei Skripal in the U.K.</p><p>In 1987, Ottawa refused to accredit Israel’s chosen military attaché Amos Yaron following reports of concerns about militia attacks on Palestinian civilians in Beirut during the 1982 Lebanon War.</p><p>There have been unconfirmed reports in recent weeks that the Trump administration could block the U.K.’s chosen ambassador to Washington, Peter Mandelson, who recently walked back previous comments that Trump was “reckless” and “a bully.”</p><p><em>This report by The Canadian Press was first published Feb. 11, 2025.</em></p>","contentLength":4823,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1in7atd/professor_says_canada_should_block_us_ambassador/"},{"title":"Germany’s far-left party sees membership surge before election","url":"https://www.politico.eu/article/germany-far-left-party-record-membership-surge-election-die-linke/","date":1739294390,"author":"/u/leadhd","guid":458,"unread":true,"content":"<div><p>Mysterious drones have repeatedly infiltrated a German base where Ukrainian troops train on Patriot systems, sparking an espionage probe and exposing gaps in Berlin’s air defense.</p></div>","contentLength":181,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1in3tyr/germanys_farleft_party_sees_membership_surge/"},{"title":"Zelensky proposes swap of seized territory with Russia","url":"https://thehill.com/policy/international/5138384-zelensky-russia-ukraine-war-trump-putin-vance-munich/","date":1739294234,"author":"/u/z8675309z","guid":455,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1in3rqc/zelensky_proposes_swap_of_seized_territory_with/"},{"title":"US restarts AIDS funding to South Africa","url":"https://za.usembassy.gov/presidents-emergency-plan-for-aids-relief-pepfar-status-frequently-asked-questions/","date":1739293727,"author":"/u/SauthEfrican","guid":451,"unread":true,"content":"<p>We’re sorry, this site is currently experiencing technical difficulties.  Please try again in a few moments.</p>","contentLength":110,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1in3kb2/us_restarts_aids_funding_to_south_africa/"},{"title":"Russia lashes out at EU plans to seize its ‘shadow fleet’ in the Baltic Sea","url":"https://www.politico.eu/article/russia-lashes-out-against-eu-plans-to-seize-its-shadow-fleet-in-the-baltic-sea/","date":1739281042,"author":"/u/ShowitThenThrowit","guid":454,"unread":true,"content":"<div><p>European countries are pushing for new powers to squeeze Moscow’s shadow fleet after a spate of incidents in the Baltic Sea.</p></div>","contentLength":126,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imyqgj/russia_lashes_out_at_eu_plans_to_seize_its_shadow/"},{"title":"Trudeau says Canada will respond firmly to unacceptable U.S. tariffs","url":"https://www.cbc.ca/news/politics/trudeau-says-canada-will-respond-firmly-to-unacceptable-u-s-tariffs-1.7455853","date":1739279069,"author":"/u/Chewbacca319","guid":457,"unread":true,"content":"<p dir=\"ltr\">Prime Minister Justin Trudeau warned U.S. Vice-President J.D. Vance that punishing tariffs on Canadian steel and aluminum will hurt his home state of Ohio, a senior Canadian official said.&nbsp;</p><p dir=\"ltr\">The two leaders met on the sidelines of an international summit in Paris, as the Trump administration moves forward with its threat to impose 25 per cent tariffs on all steel and aluminum imports, including from its biggest supplier, Canada, effective March 12.</p><p dir=\"ltr\">\"Tariffs on Canadian steel and aluminum would be entirely unjustified,\" Trudeau told reporters at the summit. \"We are the [U.S.'s] closest ally. Our economies are integrated.\"</p><p dir=\"ltr\">Trump said on Monday&nbsp;the tariffs would be imposed on steel and aluminum from all countries \"without exceptions or exemptions.\"</p><p dir=\"ltr\">The federal government will work with the Trump administration over the coming weeks, Trudeau said,&nbsp;to make sure it understands the impact the levies would have on both the U.S. and Canada.</p><p dir=\"ltr\">When asked by CBC News if he would reciprocate with matching tariffs on aluminum and steel, Trudeau said he hopes that doesn't have to happen.&nbsp;</p><p dir=\"ltr\">\"If it comes to that, our response, of course, will be firm and clear. We will stand up for Canadian workers. We will stand up for Canadian industries.\"</p><div dir=\"ltr\"><strong><em>WATCH |&nbsp;Tariffs on Canadian steel, aluminum 'entirely unjustified,' PM says:</em></strong></div><p dir=\"ltr\">Trump is promising to revive U.S. steelmaking in Rust Belt states, including Ohio, to bring back more industrial manufacturing jobs.&nbsp;</p><p dir=\"ltr\">Trudeau mentioned the impact of tariffs on Ohio to Vance, a Canadian official said. The state is America's biggest exporter sending&nbsp;more than $21&nbsp;billion US in goods to Canada in 2023, according to the U.S. Trade Representative.&nbsp;If Canada retaliates, its steel, cars, plastics, iron and plane exports could be hit with counter tariffs.</p><p dir=\"ltr\">The prime minister didn't announce specific retaliatory measures on Tuesday, but his government has warned that a trade war could drive up consumer prices and hurt the economy south of the border.</p><div dir=\"ltr\"><em><strong>WATCH | Trump imposes 25% tariff on all steel, aluminum imports:</strong></em></div><p dir=\"ltr\">The prime minister made his comments in Paris, on his way to the AI Action Summit hosted by French President Emmanuel Macron and Indian Prime Minister Narendra Modi.&nbsp;</p><p>Vance didn't respond to Canadian media's questions about the tariffs while arriving at the summit on Tuesday.&nbsp;</p><p dir=\"ltr\">The prime minister said he is also&nbsp;working with international leaders to co-ordinate a response and will be travelling to Brussels on Wednesday to meet with European Union leaders and NATO Secretary General Mark Rutte.</p><div dir=\"ltr\"><strong><em>&nbsp;Experts say new tariffs may have more of an impact than in Trump's first term:</em></strong></div>","contentLength":2625,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imy3jx/trudeau_says_canada_will_respond_firmly_to/"},{"title":"Ukraine Could Get 'War-Winning Weapons' Under New US Proposal","url":"https://www.newsweek.com/ukraine-lend-lease-weapons-us-2029195","date":1739275506,"author":"/u/eaglemaxie","guid":450,"unread":true,"content":"<p>Representative Joe Wilson, a <a href=\"https://www.newsweek.com/topic/republican\">Republican</a> from South Carolina, has proposed reauthorizing a lend-lease agreement to provide Ukraine with weapons to deter Russian President <a href=\"https://www.newsweek.com/topic/vladimir-putin\" data-sys=\"1\">Vladimir Putin</a>, whom he described as a \"war criminal.\"</p><p> has contacted Wilson's office and the Ukrainian Foreign Ministry for comment.</p><p>In 2022, <a href=\"https://www.newsweek.com/topic/congress\" data-sys=\"1\">Congress</a> passed the Ukraine Democracy Defense Lend-Lease Act to facilitate the supply of materiel to Kyiv to fight Russia. The bill expired in September 2023 without being used.</p><p>The legislation was akin to the World War II Lend-Lease Act, in which equipment is supplied at no cost and is to be used until returned or destroyed. As <a href=\"https://www.newsweek.com/ukraine-russia-war-usaid-shutdown-volodymyr-zelensky-2026893\" target=\"_blank\" rel=\"noopener\">questions hang over U.S. aid for Ukraine</a>, a new lend-lease deal could give Kyiv weapons without drawing on American taxpayer dollars.</p><p>On Monday, Wilson announced on X, formerly <a href=\"https://www.newsweek.com/topic/twitter\" data-sys=\"1\">Twitter</a>, that he would introduce the first lend-lease act to give President <a href=\"https://www.newsweek.com/topic/donald-trump\" data-sys=\"1\">Donald Trump</a> the authority to arm Ukraine against Russia.</p><p>However, Ukrainian diplomats have been lobbying for its reintroduction as it would allow the U.S. president to loan or lease arms to Ukraine while cutting through congressional red tape.</p><p>Wilson, who chairs the U.S. Helsinki Commission and the National Security and Foreign Affairs Task Force, <a rel=\"noopener nofollow\" href=\"https://x.com/RepJoeWilson/status/1889006399297859924\" target=\"_blank\">wrote</a> that he would introduce the Freedom First Lend-Lease Act to \"give President Trump flexible authorities to send war-winning weapons to our partners including Ukraine.\"</p><p>The representative said the move could help bring Russia \"to the table through American strength.\"</p><p>U.S. weapons approved for supply by former President <a href=\"https://www.newsweek.com/topic/joe-biden\" data-sys=\"1\">Joe Biden</a> are still being supplied to Ukraine, Keith Kellogg, Trump's special envoy for Ukraine and Russia, told Reuters.</p><p>However, amid speculation over Washington's military aid for Ukraine, the Trump administration intends to get allies in Europe to start buying American weapons for Ukraine, the news agency reported.</p><p>In a statement to , Ukrainian human rights lawyer Oleksandra Matviichuk, who heads the Center for Civil Liberties in Kyiv, said the congressional leaders she met with last week had showed \"unwavering solidarity and support\" for Ukraine.</p><p>She added: \"They understand the existential fight that we as Ukrainians face. We are on the frontlines in fighting for democracy and freedom, which makes our world safer.\"</p><p><strong>U.S. Representative Joe Wilson</strong>: \"Today, I will introduce the FREEDOM FIRST LEND-LEASE ACT to give President Trump flexible authorities to send war-winning weapons to our partners including Ukraine to deter War Criminal Putin as Biden should have done long ago. Bring Russia to the table through American Strength!\"</p><p><strong>Oleksandra Matviichuk, a <strong>Ukrainian human rights lawyer, told </strong></strong>: \"In speaking with my American colleagues and U.S. congressional leaders like Rep. Joe Wilson, I'm always overcome by their unwavering solidarity and support. They understand the existential fight that we as Ukrainians face.\"</p><p>Details of the bill and whether it has the backing of other members of Congress remain unclear.</p><p>It is also unclear if the U.S. plans to ask European countries to purchase American arms through commercial contracts or from the American stockpile.</p><p>Unnamed sources told Reuters that Kellogg would discuss the issue at the Munich Security Conference, which begins on Friday, as the Trump administration looks at how to continue supplying Ukraine without incurring large costs.</p><p><em>Update 2/11/25, 7:31 a.m. ET: This article has been updated with comment from Oleksandra Matviichuk.</em></p>","contentLength":3462,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imx1z8/ukraine_could_get_warwinning_weapons_under_new_us/"},{"title":"Trump says Ukraine ‘essentially agreed’ to $500 billion rare earth deal","url":"https://tvpworld.com/84986737/trump-announces-500-bln-rare-earth-deal-with-ukraine","date":1739265702,"author":"/u/KrzyHooy","guid":456,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imupw0/trump_says_ukraine_essentially_agreed_to_500/"},{"title":"Russia arrests female powerlifting champ for being ‘hired assassin’ for Ukraine","url":"https://tvpworld.com/84986757/russia-arrests-female-powerlifting-champ-for-being-hired-assassin-for-ukraine","date":1739261974,"author":"/u/KrzyHooy","guid":452,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imtx3n/russia_arrests_female_powerlifting_champ_for/"},{"title":"Trump demands $500B in rare earths from Ukraine for continued support","url":"https://www.politico.eu/article/trump-demands-500b-in-rare-earths-from-ukraine-for-support/","date":1739255907,"author":"/u/die_mannequin","guid":459,"unread":true,"content":"<div><p>“The European Union has treated us so terribly,” U.S. president complains, as Canada and Mexico get nailed with blitz of tariffs.</p></div>","contentLength":133,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1imsihw/trump_demands_500b_in_rare_earths_from_ukraine/"}],"tags":["news","reddit"]}