{"id":"6C2W1azD1rBrwqWWL9kQ1NofbtZZftJZnfQ3u9LZd8PCAaSxdSaPEux","title":"The Future Skills Podcast","displayTitle":"The Future Skills Podcast","url":"https://feeds.buzzsprout.com/1265264.rss","feedLink":"https://www.buzzsprout.com/1265264","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Special - Name Change","url":"","date":1769436000,"author":"","guid":89,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/18570816-special-name-change.mp3","enclosureMime":"","commentsUrl":null},{"title":"S5 Ep. 05 - Learning from One Another: Skills, Training, and Workforce Development in Northern Communities","url":"https://www.conferenceboard.ca/insights/podcasts/future-skills-centre","date":1758085200,"author":"","guid":88,"unread":true,"content":"<p>In this episode of the Future Skills Podcast, host Jeremy Strachan explores the complex and evolving landscape of skills development and workforce training in Northern and Indigenous communities. Amanda Thompson from The Conference Board of Canada shares insights from the Learning from One Another project, a multi-year initiative examining labour market trends and training strategies across Yukon, Nunavut, and Northern Ontario. We also hear from Kris Mullaly of the Qikiqtani Inuit Association, who discusses the Q-STEP program and Tuttarvik—community-driven initiatives that are empowering Inuit youth through culturally grounded training and employment supports. Finally, Xina Cowan of EntrepreNorth highlights how entrepreneurship is creating new pathways for economic resilience and self-determination across the North.</p><p>Amanda Thompson, Lead Research Associate, The Conference Board of Canada</p><p>Kris Mullaly, Program Manager, Qikiqtani Inuit Association</p><p>Xina Cowan, Co-Director, Skills Council of Canada</p>","contentLength":1008,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/17552888-s5-ep-05-learning-from-one-another-skills-training-and-workforce-development-in-northern-communities.mp3","enclosureMime":"","commentsUrl":null},{"title":"S5 Ep. 04 - Pathways to Self-Employment for Neurodivergent Canadians","url":"https://www.conferenceboard.ca/insights/podcasts/future-skills-centre","date":1755061200,"author":"","guid":87,"unread":true,"content":"<p>In this episode of the Future Skills Podcast, host Jeremy Strachan explores how self-employment and entrepreneurship can serve as powerful pathways for neurodivergent Canadians to thrive in the workforce. Jennifer Fane from The Conference Board of Canada discusses her Future Skills Centre-funded research on barriers facing neurodivergent entrepreneurs and the need for tailored support programs; Wanda Deschamps, founder of Liberty Co. and openly autistic entrepreneur, shares her perspective on shifting the narrative from accommodations to strengths and the importance of neuroinclusion in business; and Brad Loiselle, CEO of Skills Council of Canada, reveals how “dyslexic thinking” has fueled his serial entrepreneurship success, from building North America’s largest wrapping paper business to creating innovative educational platforms.&nbsp;</p><p>Jennifer Fane, Lead Research Associate, The Conference Board of Canada</p><p>Wanda Deschamps, Founder and Principal, Liberty Co.</p><p>Brad Loiselle, CEO and Founder, Skills Council of Canada</p>","contentLength":1028,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/17552865-s5-ep-04-pathways-to-self-employment-for-neurodivergent-canadians.mp3","enclosureMime":"","commentsUrl":null},{"title":"S5 Ep. 03: AI in the Workplace and the Skills that Matter Most","url":"https://www.conferenceboard.ca/insights/podcasts/future-skills-centre","date":1752645600,"author":"","guid":86,"unread":true,"content":"<p>In this episode of the Future Skills Podcast, host Jeremy Strachan explores the transformative world of Artificial Intelligence and its impact on the Canadian workforce. With insights from experts Noel Baldwin, Stephanie Enders, and Mark Patterson, we hear how Future Skills Centre research is helping us better understand the way AI is reshaping job markets, skills development, and employment strategies. The conversation tackles critical challenges like AI literacy, ethical considerations, and the need for adaptability in a rapidly evolving technological landscape. Discover how workers and businesses can leverage AI to enhance human skills, improve productivity, and navigate the future of work.</p><p>Noel Baldwin, Executive Director, Future Skills Centre</p><p>Stephanie Enders, Chief Delivery Officer, Alberta Machine Intelligence Institute (Amii)</p><p>Mark Patterson, Executive Director, Magnet</p>","contentLength":885,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/17331684-s5-ep-03-ai-in-the-workplace-and-the-skills-that-matter-most.mp3","enclosureMime":"","commentsUrl":null},{"title":"S5 Ep. 02: Leveraging the Skills of Newcomers","url":"https://www.conferenceboard.ca/insights/podcasts/future-skills-centre","date":1750222800,"author":"","guid":85,"unread":true,"content":"<p>In this episode of the , host Jeremy Strachan dives into the critical topic of leveraging the skills of newcomers to Canada and its impact on economic and social success. Joined by Tricia Williams from the Future Skills Centre, Sharon McLennon from the Newfoundland and Labrador Workforce Innovation Centre, and Shamira Madhany from World Education Services, the discussion explores how Future Skills Centre-funded initiatives have shed light on newcomer retention and workforce integration.&nbsp;</p><p>The episode highlights barriers such as credential recognition, workplace bias, and lack of professional networks while emphasizing solutions like targeted upskilling, wraparound supports, and cultural competency training. With insights into workforce development across Canada, this episode underscores how effectively integrating skilled immigrants is key to addressing labor shortages and boosting economic resilience.</p><p>Tricia Williams, PhD, Director of Research, Evaluation, and Knowledge Mobilization, Future Skills Centre</p><p>Sharon McLennon, Director, Newfoundland and Labrador Workforce Innovation Centre</p><p>Shamira Madhany, Managing Director and Deputy Executive Director, World Education Services</p>","contentLength":1188,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/17331165-s5-ep-02-leveraging-the-skills-of-newcomers.mp3","enclosureMime":"","commentsUrl":null},{"title":"S5 Ep. 01 - What Quality of Work Means in a Changing Labour Market","url":"https://www.conferenceboard.ca/insights/podcasts/future-skills-centre","date":1747807200,"author":"","guid":84,"unread":true,"content":"<p>What defines quality of work in today’s economy? In this episode, host Jeremy Strachan speaks with Laura McDonough from the Future Skills Centre and Dr. Olga Morawczynski from Heal-3 to explore how wages, job security, mental health, and workplace culture impact our experience at work. They discuss how research from the Future Skills Centre has shed insights on the evolving expectations of workers, the role of leadership in job satisfaction, and how benefits and training can shape long-term career well-being. As workplaces continue to change, and as Canada’s workforce challenges continue to evolve, understanding what job quality means is becoming more important than ever.</p>","contentLength":684,"flags":null,"enclosureUrl":"https://www.buzzsprout.com/1265264/episodes/17108413-s5-ep-01-what-quality-of-work-means-in-a-changing-labour-market.mp3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}