{"id":"6C2W1azD1rBrwqWWL9kQLoSHY47HEUWxCFvVZk4oAo8GpNfK6cQ6P5U","title":"ReCollections","displayTitle":"ReCollections","url":"https://feeds.megaphone.fm/recollections","feedLink":"https://parks.canada.ca/recollections","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"Bar U Ranch: Grass Into Money","url":"https://parks.canada.ca/recollections","date":1770307200,"author":"","guid":65,"unread":true,"content":"<p>For seven decades, the Bar U operated as a corporate ranch, with thousands of cattle fattening up on protein-rich fescue grass in Alberta’s Rocky Mountain foothills. But that grass has a history of its own, co-evolving on this landscape with a different grazer - the bison - over thousands of years. Through the history of three animals who’ve left their hoofmarks upon the prairie grasslands - bison, cattle and horses - we look at Canada’s “beef bonanza” that employed a colourful cast of cowboys, cooks and capitalists, turning grass into money at Bar U Ranch National Historic Site.</p><p>Special thanks to Jessica Hill.</p><p>Do you have a suggestion for a new National Historic Person, Site or Event? We’d love to hear it! Visit <a href=\"https://parks.canada.ca/commemorate\"><u>https://parks.canada.ca/commemorate</u></a> for details on how to submit a nomination.</p>","contentLength":811,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/CAN8574855784.mp3","enclosureMime":"","commentsUrl":null},{"title":"Waterton Lakes: Archaeology in a Burned Landscape","url":"https://parks.canada.ca/recollections","date":1769702400,"author":"","guid":64,"unread":true,"content":"<p>In August 2017, a lightning strike near Waterton Lakes National Park sparked a devastating wildfire that burned nearly 40% of the park. But in the wake of destruction came a once-in-a-lifetime opportunity. We’ll hear from archaeologists and Blackfoot elders about the collaborative archaeology project that’s deepening our understanding of the lives of Indigenous peoples who have lived and travelled in the Rocky Mountains and foothills for millennia.&nbsp;</p><p>Do you have a suggestion for a new National Historic Person, Site or Event? We’d love to hear it! Visit <a href=\"https://parks.canada.ca/commemorate\"><u>https://parks.canada.ca/commemorate</u></a> for details on how to submit a nomination.</p>","contentLength":642,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/CAN6760588597.mp3","enclosureMime":"","commentsUrl":null},{"title":"Fort Lennox: The Accidental Immigrants","url":"https://parks.canada.ca/recollections","date":1769101200,"author":"","guid":63,"unread":true,"content":"<p>In 1930s Europe, thousands of Jewish men and teenagers escaped the Nazi regime as refugees, only to be labelled as “enemy aliens” and sent to internment camps across eastern Canada. One of those camps was at Fort Lennox, an old military stronghold on Quebec’s Ile aux Noix. We’ll hear from one internee, the late Rabbi Erwin Schild, whose story helps illustrate the experience of hundreds of German and Austrian Jews who were imprisoned at Fort Lennox National Historic Site.</p><p><strong>Oral history recordings of Rabbi Erwin Schild used in this episode:</strong></p><ul><li>Faye Blum of the Ontario Jewish Archives\n</li><li>Teigan Goldsmith of the Ottawa Jewish Archives\n</li><li>The Montreal Holocaust Museum\n</li><li>The Toronto Holocaust Museum\n</li></ul><p>Do you have a suggestion for a new National Historic Person, Site or Event? We’d love to hear it! </p>","contentLength":797,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/CAN7739910172.mp3","enclosureMime":"","commentsUrl":null},{"title":"Red Bay: Discovering the Basque Whalers of Terra Nova","url":"https://parks.canada.ca/recollections","date":1768505220,"author":"","guid":62,"unread":true,"content":"<p>The southern coast of Labrador in the 1500s was the scene of Canada’s first oil boom. Each summer, Basque crews from Spain and France traversed the Atlantic to hunt whales and render their blubber into a precious commodity: oil that lit the lamps of Europe. It was dangerous, messy… and profitable. The story was all but lost until the 1970s, when researchers and archaeologists flocked to the tiny community of Red Bay, digging in the gardens and diving in the harbour, to uncover the secrets of Red Bay National Historic Site, a UNESCO World Heritage Site.</p><p>Special thanks to Joxe Felipe Auzmendi and Iñaki Beraetxe, to Daniel Payne for use of his song and to Javier Vicente for recording assistance. </p><p>Our condolences to the family of Robert Grenier, who led Parks Canada’s underwater archaeology work at Red Bay. Robert passed away in January 2026. </p><p>\nDo you have a suggestion for a new National Historic Person, Site or Event? We’d love to hear it! </p>","contentLength":957,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/CAN3034771106.mp3","enclosureMime":"","commentsUrl":null},{"title":"ReCollections is back for Season Two","url":"https://parks.canada.ca/recollections","date":1768434720,"author":"","guid":61,"unread":true,"content":"\n        ReCollections, the award-winning history and archaeology podcast from Parks Canada, is back for Season Two. \nFour new stories from national parks and national historic sites across Canada:\n\n<ul><li> Red Bay: Discovering the Basque Whalers of Terra Nova</li><li> Fort Lennox: The Accidental Immigrants</li><li> Bar U Ranch: Grass Into Money</li><li>Waterton Lakes: Archaeology in a Burned Landscape</li></ul><p>\nJoin us for a journey of national historic significance.\n</p>","contentLength":429,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/CAN3508894371.mp3?updated=1768431197","enclosureMime":"","commentsUrl":null}],"tags":[]}