{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Why did you choose the distro you use now?","url":"https://www.reddit.com/r/linux/comments/1incot7/why_did_you_choose_the_distro_you_use_now/","date":1739316257,"author":"/u/RadMarioBuddy45","guid":378,"unread":true,"content":"<p>I personally chose Linux Mint because most things work out of the box. All you need to do is remove the bloatware (optional), personalize everything, install all your apps, then you're all set. There's other factors involved, but they aren't significant enough to include here. Why did you choose the distro you use now?</p>","contentLength":320,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Future of KDE Themes - Introducing KDE Union and Plasma Next","url":"https://tube.kockatoo.org/w/2rkFgbDViQVa4tjoXCrbF7","date":1739308006,"author":"/u/Nova_496","guid":377,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1in9fjh/the_future_of_kde_themes_introducing_kde_union/"},{"title":"GNOME’s new main website has launched!","url":"https://www.gnome.org/","date":1739291404,"author":"/u/BrageFuglseth","guid":381,"unread":true,"content":"<h2>A more elegant way to use your computer</h2><p>Hit the  any time to get an overview, switch or launch apps,\n         and search for anything on your computer. It's magic.</p>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1in2mhv/gnomes_new_main_website_has_launched/"},{"title":"Engineering Ubuntu For The Next 20 Years","url":"https://discourse.ubuntu.com/t/engineering-ubuntu-for-the-next-20-years/55000","date":1739281103,"author":"/u/EvilDMP","guid":379,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1imyr6r/engineering_ubuntu_for_the_next_20_years/"},{"title":"KDE Plasma 6.3 released","url":"https://kde.org/announcements/plasma/6/6.3.0/","date":1739280336,"author":"/u/JRepin","guid":382,"unread":true,"content":"<div><p>One year on, with the teething problems a major new release inevitably brings firmly behind us, Plasma’s developers have worked on fine-tuning, squashing bugs and adding features to Plasma 6 — turning it into the best desktop environment for everyone!</p><p>Read on to discover all the exciting new changes landing in this release…</p></div><section><div><div><div><p>Duplicate your setup with one click</p></div><div><p>Pinpoint individual pixels</p></div><div><p>Fine tune your art hardware</p></div></div></div></section><div><p>We want to make Plasma the best platform for creativity, and Plasma 6.3 takes the next step in that direction by providing features that help artists optimize and customize their graphics tablets to their liking.</p><p>The System Settings’  page has been overhauled and split into multiple tabs to improve how things are organized, and new configuration options have been added to each section:</p><ul><li>You can map an area of a drawing tablet’s surface to the entire screen area</li><li>We have refined the tablet calibration feature so that it produces more accurate calibrations</li><li>The stylus testing feature shows information about tilt and pressure</li><li>You can customize the pressure curve and range of a stylus to chop off the high and/or low parts</li><li>You can also re-map or swap the functions of the stylus’s buttons</li></ul><p>After finishing configuring your tablet, you’ll be able to see what changed thanks to ’ “Highlight changed settings” feature, which works for most of the  page.</p></div><div><div><p>The most important news regarding graphics is a huge overhaul of how fractional scaling works. In Plasma 6.3, KWin makes a stronger effort to snap things to the screen’s pixel grid, greatly reducing blurriness and visual gaps everywhere and producing sharper and crisper images.</p><p>This works at very high zoom levels as well, as KWin’s Zoom effect switches to a sharp pixel-perfect representation and overlays a grid on top of the screen. You can actually see how individual pixels look relative to other ones. Very useful for artists and designers.</p><p>In the color department, screen colors are more accurate when using the  feature both with and without <a href=\"https://en.wikipedia.org/wiki/ICC_profile\">ICC profiles</a>, and KWin offers the option to choose screen color accuracy — although this can sometimes affect system performance.</p><p>A smaller but still nice detail is that widgets placed on the desktop are very slightly translucent, just like the popups of widgets placed on the panel:</p></div></div><div><p> monitors CPU usage more accurately, and consumes vastly fewer CPU resources while doing it! If you’re using Plasma 6.3 on FreeBSD, you’re in luck: the System Monitor app and widgets can now collect GPU statistics on your system too.</p><p> also provides more information, exposing data about all of your GPUs as well as your batteries’ cycle counts.</p><p>Monitoring printers is equally easy, as each printer’s print queue is shown directly in the widget. The widget also shows a little spinner on any printers that are currently printing, so you can see at a glance which ones are in use.</p><p>Plasma already includes a variety of background services that let you know when something has gone wrong and what to do about it. New in Plasma 6.3 is a service that detects when the kernel terminated an app because the system ran out of memory. The service shows a notification explaining what happened, and suggests ways of avoiding this issue in the future.</p></div><div><p>Moving on to specific tools, Plasma 6.3’s  (the built-in search tool that also does conversions, calculations, definitions, graph plotting, and much more),  (Plasma’s software management/app store application), and the  widget all come with new features and improvements:</p><p>KRunner and KRunner-powered searches now let you jump between categories using the / keys and +/+ key combinations.</p><p>A security enhancement landing in Discover highlights sandboxed apps whose permissions will change after being updated. This allows you to check on such changes in case you suspect any shady behavior.</p><p>In a similar vein, you can now see whether apps are packaged directly by their developer, or verified by a trusted third party.</p><p>If you’re a fan of the forecasts provided by <a href=\"https://www.dwd.de\">Deutscher Wetterdienst</a>, you’re in luck: Plasma 6.3’s weather widget allows using this source for weather data.</p></div><section><div><div><div><p>Plasma 6.3 makes things easy without ditching flexibility. If you prefer using a mouse with your laptop, you can now configure its built-in touchpad to switch off automatically, so it doesn’t interfere with your typing. Also, if you set up your machine as a network hotspot, Plasma generates a random password for the network so you don’t have to think one up.</p><p>Finding help is easier in Plasma 6.3. A “Help” category has been added to the launcher (the menu that tends to live on the left hand side of your panel), and we have removed the  category entirely. Its contents have been merged into the  category, reducing the number of categories that don’t offer meaningful grouping.</p><p>Speaking of menus, the default  launcher menu now switches categories only when you click on them, matching the behavior of all other sidebar lists. However, if you preferred the old switch-on-hover behavior, it’s still available too.</p><p>We have made things clearer by adding a  item to the desktop context menu for symbolic links, the digital Clock widget displays all events on days with more than five of them (giving you a complete view of upcoming commitments), and when you want to reboot into the bootloader menu the next time your machine reboots, the logout screen now indicates this.</p><p>To avoid overwhelming you with too much information, when notifications arrive while Plasma’s “Do Not Disturb” mode is engaged, exiting that mode shows the number of missed notifications, rather than sending them all in one giant torrent.</p><p>Additionally, a subtle but important change: when you drag a file out of a window that’s partially below other windows, it no longer jumps to the top, potentially obscuring what you wanted to drag it into!</p></div></div></div></section><div><p>Finally, what would Plasma be without customization? To begin with, panels can be cloned! You can also use scripting to change your panels’ opacity levels and what screen they appear on.</p><p>In Plasma 6.2, we introduced symbolic icons in ’s category sidebar. Some people didn’t like that, so in 6.3 you can undo the change yourself: we modified the implementation to pull icons from the standard data source, allowing you to set them to whatever you want using the  app.</p><p>Speaking of the  app, editing desktop files for apps from the “Edit Application…” menu item in  (and other launcher menus) opens the app in the editor, rather than showing you file properties. This lets you easily edit the entire applications list!</p><p>If you have ever lost a widget in the process of customizing your system, you’ll love this new feature: in Plasma 6.3, the  gives you the opportunity to remove every instance of a widget, including those that got lost or are only present on unplugged screens.</p></div><div>…and there’s much more. To see the full list of changes, check out the <a href=\"https://kde.org/announcements/changelogs/plasma/6/6.2.5-6.3.0/\">complete changelog for Plasma 6.3</a>.</div><section><section><p>You can give us feedback and get updates on our social media channels:\n<a href=\"https://go.kde.org/matrix/#/#kde:kde.org\" aria-label=\"Share on Matrix\"></a><a href=\"https://floss.social/@kde\" aria-label=\"Share on Mastodon\"></a><a href=\"https://bsky.app/profile/kde.org\" aria-label=\"Share on Bluesky\"></a><a href=\"https://www.facebook.com/kde/\" aria-label=\"\"></a><a href=\"https://www.linkedin.com/company/29561/\" aria-label=\"Share on LinkedIn\"></a><a href=\"https://www.reddit.com/r/kde/\" aria-label=\"Share on Reddit\"></a><a href=\"https://lemmy.kde.social/\" aria-label=\"Share on Lemmy\"></a><a href=\"https://www.youtube.com/@KdeOrg\" aria-label=\"Share on YouTube\"></a><a href=\"https://tube.kockatoo.org/a/kde_community/video-channels\" aria-label=\"Share on PeerTube\"></a><a href=\"https://vk.com/kde_ru\" aria-label=\"Share on VK\"></a><a href=\"https://www.instagram.com/kdecommunity/\" aria-label=\"Share on Instagram\"></a></p><p align=\"justify\">Your feedback is greatly appreciated.</p></section><p align=\"justify\">KDE is a <a href=\"https://www.gnu.org/philosophy/free-sw.html\">Free Software</a> community that exists and grows only because of the help of many volunteers that donate their time and effort. KDE is always looking for new volunteers and contributions, whether it is help with coding, bug fixing or reporting, writing documentation, translations, promotion, money, etc. All contributions are gratefully appreciated and eagerly accepted. Please read through the <a href=\"https://kde.org/community/donations/\">Supporting KDE page</a> for further information or become a KDE e.V. supporting member through our <a href=\"https://kde.org/community/donations/\">Join the Game</a> initiative.</p><p align=\"justify\">KDE is an international technology team that creates free and open source software for desktop and portable computing. Among KDE’s products are a modern desktop system for Linux and UNIX platforms, comprehensive office productivity and groupware suites and hundreds of software titles in many categories including Internet and web applications, multimedia, entertainment, educational, graphics and software development. KDE software is translated into more than 60 languages and is built with ease of use and modern accessibility principles in mind. KDE’s full-featured applications run natively on Linux, BSD, Windows, Haiku, and macOS.</p></section>","contentLength":8232,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1imyi1s/kde_plasma_63_released/"},{"title":"nowdays linux is game ready too, kvm+looking-glass","url":"https://www.reddit.com/r/linux/comments/1imsdso/nowdays_linux_is_game_ready_too_kvmlookingglass/","date":1739255386,"author":"/u/Impossible_Fix_6127","guid":380,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev","reddit"]}