{"id":"AXJnNj1p7gNGHeShbM5NH2qrEU51AXyHm","title":"Julia Evans","displayTitle":"Dev - Julia Evans","url":"https://jvns.ca/atom.xml","feedLink":"https://jvns.ca/atom.xml","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Some terminal frustrations","url":"https://jvns.ca/blog/2025/02/05/some-terminal-frustrations/","date":1738774620,"author":"Julia Evans","guid":1,"unread":true,"content":"<blockquote><p>What’s the most frustrating thing about using the terminal for you?</p></blockquote><p>1600 people answered, and I decided to spend a few days categorizing all the\nresponses. Along the way I learned that classifying qualitative data is not\neasy but I gave it my best shot. I ended up building a custom\n<a href=\"https://github.com/jvns/classificator\">tool</a> to make it faster to categorize\neverything.</p><p>As with all of my surveys the methodology isn’t particularly scientific. I just\nposted the survey to Mastodon and Twitter, ran it for a couple of days, and got\nanswers from whoever happened to see it and felt like responding.</p><p>Here are the top categories of frustrations!</p><p>I think it’s worth keeping in mind while reading these comments that</p><ul><li>40% of people answering this survey have been using the terminal for </li><li>95% of people answering the survey have been using the terminal for at least 4 years</li></ul><p>These comments aren’t coming from total beginners.</p><p>Here are the categories of frustrations! The number in brackets is the number\nof people with that frustration. I’m mostly writing this up for myself because\nI’m trying to write a zine about the terminal and I wanted to get a sense for\nwhat people are having trouble with.</p><p>People talked about struggles remembering:</p><ul><li>the syntax for CLI tools like awk, jq, sed, etc</li><li>keyboard shortcuts for tmux, text editing, etc</li></ul><blockquote><p>There are just so many little “trivia” details to remember for full\nfunctionality. Even after all these years I’ll sometimes forget where it’s 2\nor 1 for stderr, or forget which is which for  and .</p></blockquote><h3>switching terminals is hard (91)</h3><p>People talked about struggling with switching systems (for example home/work\ncomputer or when SSHing) and running into:</p><ul><li>OS differences in keyboard shortcuts (like Linux vs Mac)</li><li>systems which don’t have their preferred text editor (“no vim” or “only vim”)</li><li>different versions of the same command (like Mac OS grep vs GNU grep)</li><li>a shell they aren’t used to (“the subtle differences between zsh and bash”)</li></ul><p>as well as differences inside the same system like pagers being not consistent\nwith each other (git diff pagers, other pagers).</p><blockquote><p>I got used to fish and vi mode which are not available when I ssh into\nservers, containers.</p></blockquote><p>Lots of problems with color, like:</p><ul><li>programs setting colors that are unreadable with a light background color</li><li>finding a colorscheme they like (and getting it to work consistently across different apps)</li><li>color not working inside several layers of SSH/tmux/etc</li><li>not wanting color at all and struggling to turn it off</li></ul><p>This comment felt relatable to me:</p><blockquote><p>Getting my terminal theme configured in a reasonable way between the terminal\nemulator and fish (I did this years ago and remember it being tedious and\nfiddly and now feel like I’m locked into my current theme because it works\nand I dread touching any of that configuration ever again).</p></blockquote><p>Half of the comments on keyboard shortcuts were about how on Linux/Windows, the\nkeyboard shortcut to copy/paste in the terminal is different from in the rest\nof the OS.</p><p>Some other issues with keyboard shortcuts other than copy/paste:</p><ul><li>using  in a browser-based terminal and closing the window</li><li>the terminal only supports a limited set of keyboard shortcuts (no\n, no , no , lots of  shortcuts aren’t\npossible like )</li><li>the OS stopping you from using a terminal keyboard shortcut (like by default\nMac OS uses  for something else)</li><li>issues using emacs in the terminal</li><li>backspace not working (2)</li></ul><h3>other copy and paste issues (75)</h3><p>Aside from “the keyboard shortcut for copy and paste is different”, there were\na lot of OTHER issues with copy and paste, like:</p><ul><li>how tmux and the terminal emulator both do copy/paste in different ways</li><li>dealing with many different clipboards (system clipboard, vim clipboard, the\n“middle click” clipboard on Linux, tmux’s clipboard, etc) and potentially\nsynchronizing them</li><li>random spaces added when copying from the terminal</li><li>pasting multiline commands which automatically get run in a terrifying way</li><li>wanting a way to copy text without using the mouse</li></ul><p>There were lots of comments about this, which all came down to the same basic\ncomplaint – it’s hard to discover useful tools or features! This comment kind of\nsummed it all up:</p><blockquote><p>How difficult it is to learn independently. Most of what I know is an\nassorted collection of stuff I’ve been told by random people over the years.</p></blockquote><h3>steep learning curve (44)</h3><p>A lot of comments about it generally having a steep learning curve. A couple of\nexample comments:</p><blockquote><p>After 15 years of using it, I’m not much faster than using it than I was 5 or\nmaybe even 10 years ago.</p></blockquote><blockquote><p>That I know I could make my life easier by learning more about the shortcuts\nand commands and configuring the terminal but I don’t spend the time because it\nfeels overwhelming.</p></blockquote><p>Some issues with shell history:</p><ul><li>history not being shared between terminal tabs (16)</li><li>limits that are too short (4)</li><li>history not being restored when terminal tabs are restored</li><li>losing history because the terminal crashed</li><li>not knowing how to search history</li></ul><blockquote><p>It wasted a lot of time until I figured it out and still annoys me that\n“history” on zsh has such a small buffer;  I have to type “history 0” to get\nany useful length of history.</p></blockquote><ul><li>documentation being generally opaque</li><li>lack of examples in man pages</li><li>programs which don’t have man pages</li></ul><p>Here’s a representative comment:</p><blockquote><p>Finding good examples and docs. Man pages often not enough, have to wade\nthrough stack overflow</p></blockquote><p>A few issues with scrollback:</p><ul><li>programs printing out too much data making you lose scrollback history</li><li>resizing the terminal messes up the scrollback</li><li>GUI programs that you start in the background printing stuff out that gets in\nthe way of other programs’ outputs</li></ul><blockquote><p>When resizing the terminal (in particular: making it narrower) leads to\nbroken rewrapping of the scrollback content because the commands formatted\ntheir output based on the terminal window width.</p></blockquote><p>Lots of comments about how the terminal feels hampered by legacy decisions and\nhow users often end up needing to learn implementation details that feel very\nesoteric. One example comment:</p><blockquote><p>Most of the legacy cruft, it would be great to have a green field\nimplementation of the CLI interface.</p></blockquote><p>Lots of complaints about POSIX shell scripting. There’s a general feeling that\nshell scripting is difficult but also that switching to a different less\nstandard scripting language (fish, nushell, etc) brings its own problems.</p><blockquote><p>Shell scripting. My tolerance to ditch a shell script and go to a scripting\nlanguage is pretty low. It’s just too messy and powerful. Screwing up can be\ncostly so I don’t even bother.</p></blockquote><p>Some more issues that were mentioned at least 10 times:</p><ul><li>(31) inconsistent command line arguments: is it -h or help or –help?</li><li>(24) keeping dotfiles in sync across different systems</li><li>(23) performance (e.g. “my shell takes too long to start”)</li><li>(20) window management (potentially with some combination of tmux tabs, terminal tabs, and multiple terminal windows. Where did that shell session go?)</li><li>(17) generally feeling scared/uneasy (“The debilitating fear that I’m going\nto do some mysterious Bad Thing with a command and I will have absolutely no\nidea how to fix or undo it or even really figure out what happened”)</li><li>(16) terminfo issues (“Having to learn about terminfo if/when I try a new terminal emulator and ssh elsewhere.”)</li><li>(16) lack of image support (sixel etc)</li><li>(15) SSH issues (like having to start over when you lose the SSH connection)</li><li>(15) various tmux/screen issues (for example lack of integration between tmux and the terminal emulator)</li><li>(13) the terminal getting messed up for various reasons (pressing , ing a binary, etc)</li><li>(12) quoting/escaping in the shell</li><li>(11) various Windows/PowerShell issues</li></ul><p>There were also 122 answers to the effect of “nothing really” or “only that I\ncan’t do EVERYTHING in the terminal”</p><blockquote><p>Think I’ve found work arounds for most/all frustrations</p></blockquote><p>I’m not going to make a lot of commentary on these results, but here are a\ncouple of categories that feel related to me:</p><ul><li>remembering syntax &amp; history (often the thing you need to remember is something you’ve run before!)</li><li>discoverability &amp; the learning curve (the lack of discoverability is definitely a big part of what makes it hard to learn)</li><li>“switching systems is hard” &amp; “it feels outdated” (tools that haven’t really\nchanged in 30 or 40 years have many problems but they do tend to be always\n no matter what system you’re on, which is very useful and makes them\nhard to stop using)</li></ul><p>Trying to categorize all these results in a reasonable way really gave me an\nappreciation for social science researchers’ skills.</p>","contentLength":8518,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["dev"]}