{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppcAkJboXbBkLNyQBrvWYH1pGPuMxJaC","title":"ACOACanada","displayTitle":"ACOACanada","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCFRoY5IvADtfCf1folzzc-A","feedLink":"https://www.youtube.com/channel/UCFRoY5IvADtfCf1folzzc-A","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":12,"items":[{"title":"A conversation on powering prosperity in Atlantic Canada","url":"https://www.youtube.com/watch?v=aLCjXKGnHR8","date":1764063816,"author":"ACOACanada","guid":101,"unread":true,"content":"<article>Join Minister Fraser and Don Mills for a conversation on collaboration, innovation, and reshaping our future.</article>","contentLength":109,"flags":null,"enclosureUrl":"https://www.youtube.com/v/aLCjXKGnHR8?version=3","enclosureMime":"","commentsUrl":null},{"title":"ACOACanada Live Stream","url":"https://www.youtube.com/watch?v=ZfHRau2A_3k","date":1763989040,"author":"ACOACanada","guid":100,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZfHRau2A_3k?version=3","enclosureMime":"","commentsUrl":null},{"title":"Rodd Charlottetown - Charlottetown, PEI","url":"https://www.youtube.com/watch?v=42qCJIzB0vM","date":1761331217,"author":"ACOACanada","guid":99,"unread":true,"content":"<article>The Rodd family has been a driving force in Atlantic Canada’s tourism industry for 90 years, and their stunning renovation of Rodd  Charlottetown this year shows they have no plans of slowing down.\n\nTranscript\nThe Rodd Charlottetown Hotel has been welcoming guests since 1931.\nThe oldest heritage hotel in Prince Edward Island, the property combines old world charm with modern amenities. \nWith 115 rooms, a restaurant and Victorian-style conference rooms, the full-service hotel is a cornerstone of the downtown core.\nIt's one of four remaining hotels built across the country by Canadian National Railway.\nIn 2024, the historic property began an extensive $10 million renovation.\nThe major project included restoration of the building’s brick exterior, upgrades to the guest rooms and improvements to energy efficiency.\nThe goal is to preserve the historical integrity of the building while preparing the property for another 100 years.\nACOA is proud to support the Rodd Charlottetown Hotel as they honour the past and seize today’s opportunities.</article>","contentLength":1055,"flags":null,"enclosureUrl":"https://www.youtube.com/v/42qCJIzB0vM?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Smart Energy Company - Upper Golden Grove, New Brunswick","url":"https://www.youtube.com/shorts/d1uwy5RPoLg","date":1761305861,"author":"ACOACanada","guid":98,"unread":true,"content":"<article>The Smart Energy Company is helping farmers cut costs &amp; embrace sustainability. With ACOA’s support, this Atlantic Canadian small biz is scaling clean energy across Canada.</article>","contentLength":174,"flags":null,"enclosureUrl":"https://www.youtube.com/v/d1uwy5RPoLg?version=3","enclosureMime":"","commentsUrl":null},{"title":"Emmerson Packaging – Amherst, Nova Scotia","url":"https://www.youtube.com/watch?v=CrR1DI3Scn4","date":1760615223,"author":"ACOACanada","guid":97,"unread":true,"content":"<article>Emmerson Packaging is a 3rd-generation family-owned manufacturer and supplier of premium flexible packaging. The company is investing to reduce its carbon footprint and save money, estimating that modern equipment purchased with ACOA support will save $500,000 a year.\n\nTrancript\nEmmerson Packaging estimates modern equipment purchased with ACOA support will save $500,000 a year.\n\nThe 3rd-generation family business has 450 employees and 2 facilities in Amherst, Nova Scotia and Belleville, Ontario.\n\nIt manufactures and supplies premium flexible packaging to industries across North America.\n\nAs a certified Sustainable Green Printer, Emmerson Packaging makes sustainability a priority. \n\nIts new laminator will decrease energy use by 20%, decrease waste, and create 12 new jobs.\n\nThe company is investing to reduce its carbon footprint and \nsave money.</article>","contentLength":855,"flags":null,"enclosureUrl":"https://www.youtube.com/v/CrR1DI3Scn4?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Defence Advantage: Built in Atlantic Canada","url":"https://www.youtube.com/watch?v=t77YfP9hP8A","date":1759151621,"author":"ACOACanada","guid":96,"unread":true,"content":"<article>Atlantic Canada is driving Canada’s defence industry — with innovation, talent, and technology that keep our country secure.\nFrom shipbuilding to maintenance and repairs, simulation and training, ground vehicle solutions, cyber resilience, and advanced manufacturing, this region is shaping the future of defence and security.\nSee how Atlantic Canada is:\n• Building world-class solutions in the land, naval and aerospace domains\n• Creating highly skilled jobs and long-term growth\n• Strengthening Canada’s security at home and abroad\n#AtlanticCanada #DefenceIndustry #Innovation #AerospaceandDefence #Security #shipbuildingstocks \n\nTranscription:\nCanada’s defence future is being built right here in Atlantic Canada.\nAt COVE, where companies fast-track, test, and validate new technology.\nAt NATO’s Defence Innovation Accelerator for the North Atlantic - known as DIANA – where innovators access funding, mentorship, and NATO’s global innovation network.\nAt PAL Aerospace and IMP Aerospace &amp; Defence - where skilled workers keep our skies secure, coasts monitored, and military aircraft ready-to-fly.\nAt Irving Shipbuilding – where Canada’s next-generation naval and coast guard vessels are being built.\nAnd at Atlantic Canada Aerospace &amp; Defence Association member companies across the region, serving both commercial and defence markets globally.\nAtlantic Canada goes above and beyond to support national defence efforts.\nAnd with more defence spending coming, this region is ready to lead.\nAtlantic Canada’s defence industry is a national strength.\nWe have the people and the know-how to lead the way, and build a safer world.</article>","contentLength":1655,"flags":null,"enclosureUrl":"https://www.youtube.com/v/t77YfP9hP8A?version=3","enclosureMime":"","commentsUrl":null},{"title":"Bridgewater Ready Mix, Bridgewater, Nova Scotia","url":"https://www.youtube.com/watch?v=nCMGEtaxe2w","date":1758286953,"author":"ACOACanada","guid":95,"unread":true,"content":"<article>Bridgewater Ready Mix in NS is making concrete more eco-friendly. With support from ACOA, it’s producing greener concrete and cutting emissions. The company plans to switch to clean energy and reduce CO₂ by 40% by 2030. \n\nTranscript\nBridgewater Ready Mix in Bridgewater, Nova Scotia takes concrete performance and global warming seriously.\nThe company is committed to the industry’s plan for net-zero concrete by 2050. \nWith help from ACOA, Bridgewater Ready Mix is increasing green concrete production.\nIts greening initiatives include many factors.\nThe company is the first in the province to publish Type III Environmental Product Declarations.\nThis provides transparent, objective, and third-party verified data about the environmental performance of its products.\nThe company is an early adopter of limestone cement, which reduces emissions by up to 10% compared to regular cement.\nAnd it is making plans to switch to cleaner energy resources to power the plant, mix and transport cement.\nGreener products, with performance customers count on.\nBridgewater Ready Mix aims to reach a 40% CO2 reduction by 2030 on the path to net-zero.</article>","contentLength":1143,"flags":null,"enclosureUrl":"https://www.youtube.com/v/nCMGEtaxe2w?version=3","enclosureMime":"","commentsUrl":null},{"title":"Ability NB and the Municipality of Grand Lake - New Brunswick","url":"https://www.youtube.com/shorts/dAfe6-u3hlc","date":1757593426,"author":"ACOACanada","guid":94,"unread":true,"content":"<article>Accessibility is more than a checklist — it’s a mindset.  \n   \nThanks to a partnership between Ability New Brunswick and the Municipality of Grand Lake, supported by ACOA, rural communities are embracing inclusive design and transforming public spaces.  \n   \nThis story shows how thoughtful collaboration can lead to lasting impact — and a more accessible future for everyone.\n\nExecutive Director of Ability NB, Haley Flaro, says:\n“This is our first collaboration with ACOA, and it’s a shining example of what’s possible when federal partners work hand-in-hand with communities.”\n\nTranscript:\nAlyson:\n\nIt all started we were planning to make some renovations to the washroom facilities at the Chipman Heritage Centre.\n\nWe knew kinda through residents that they were not easily accessible in a wheelchair or mobility aid.\n\nI ended up speaking with Ability New Brunswick. They let us know that they actually had a free accessibility review that they could do of our buildings.\n\nWe learned so much about tactical signage, making sure that our spaces are cane friendly.\n\nIt was so much more than just ensuring that people can enter the building.\n\nAnd from there, we've really started a wonderful collaboration with them that we know will continue past just these buildings.\n\nWe have more throughout the municipality, and we are also just really doing our best to promote it to other private businesses in the community.\n\n\nHaley Flaro:\n\nI just love this collaboration because it’s a perfect example of community working with community.\n\nAnd the large tourism that happens, especially in the Grand Lake area drawing more people in to the communities to be able to access important museums, infrastructure, you know, recreation areas.\n\nIt’s really critical., so we’re really proud of this collaboration.</article>","contentLength":1816,"flags":null,"enclosureUrl":"https://www.youtube.com/v/dAfe6-u3hlc?version=3","enclosureMime":"","commentsUrl":null},{"title":"PEI Preserve Co. - New Glasgow, Prince Edward Island","url":"https://www.youtube.com/watch?v=bSgI3SbrAa8","date":1756383105,"author":"ACOACanada","guid":93,"unread":true,"content":"<article>The PEI Preserve Company is celebrating 40 years of good taste and tradition 🎉🍓🫐\nA pioneer in the Canadian specialty food industry, the company is embracing innovation and automation so they can spread preserves and joy around the world!\n\nTranscript - \nBuilt on old-fashioned values of quality and hospitality, the PEI Preserve Co. has been a pioneer in the Canadian specialty food industry since 1985.\nFounded by Bruce and Shirley MacNaughton, a humble jar of handmade preserves quickly transformed into an iconic Island business.\nThe operation blossomed to include a river-front restaurant, gift shop, theatre café, 12 acres of gardens, a butterfly house...\n...and of course...\n...preserves!\nThe preserves are sold worldwide through the company’s online giftshop, and in three locations across the Island.\nIn 2022, the company was purchased by Adam and Marsha Doiron, who held strong ties to the business and saw its growth potential.\nThe Doirons celebrated the company’s 40th “Jam-iversary” in 2025, welcoming all who have been a part of the PEI Preserve Co. story.\nIt was a joyful afternoon full of flavour, music and reflection.\nAnd special guest Chef Michael Smith opened the 5-millionth jar!\nPEI Preserve Co. produces up to 100,000 jars per year, and demand continues to grow.\nSo, what’s next?\nThe Doirons have plans to expand the product line and scale up production to 500,000 jars per year by 2027.\nThe Government of Canada is helping businesses like PEI Preserve Co. become more productive and reach new markets.\nACOA is proud to support PEI Preserve Co. as they spread jam and joy around the world!</article>","contentLength":1630,"flags":null,"enclosureUrl":"https://www.youtube.com/v/bSgI3SbrAa8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Kings County Roadtrip, PEI","url":"https://www.youtube.com/watch?v=gN-tLRLOeQY","date":1751022090,"author":"ACOACanada","guid":92,"unread":true,"content":"<article>There’s never been a better time to hit the road and support Canadian businesses and communities. Hop in and buckle up as we take a trip through Kings County, Prince Edward Island! 🚗🗺️\n\nTranscription\nLet’s take a trip through Kings County, PEI!\nThis 2-day itinerary is jam packed with authentic sights, flavours and experiences. Follow along!\nStop #1 Overnight at 45 Steps Inn in St. Peter’s Bay\nStop #2 Spend a rejuvenating morning at Mysa Nordic Spa\nStop #3 Head to the Eastern-most point of PEI to see the East Point Lighthouse\nStop #4 Learn about the history of railroad on the Island at the Elmira Railway Museum \nStop #5 In the friendly seaside town of Souris, walk the boardwalk and enjoy fresh seafood for dinner\nStop #6 Catch a live music show at the Souris Show Hall\nStop #7 Drive south and spend the night at Rodd Brudenell River Resort in Cardigan\nStop #8 Get out on the water with Tranquility Cove Adventures\nStop #9 Pick up a sandwich and fresh local berries at Nabuurs Gardens\nStop #10 Step back in time for an afternoon at Roma National Historic Site\nStop #11 Grab a coffee and shop around Montague\nStop #12 Check out Bogside Brewing Taproom for dinner \nStop #13 Drink in the sweeping views at Double Hill Cidery in Caledonia\nStop #14 Wrap up your trip with a one-of-a-kind stay at Nellie’s Landing in Murray Harbour!\nThanks for coming along on our road trip through Kings County, PEI!\nGot wanderlust? Hit the road and support Atlantic Canadian businesses!</article>","contentLength":1488,"flags":null,"enclosureUrl":"https://www.youtube.com/v/gN-tLRLOeQY?version=3","enclosureMime":"","commentsUrl":null},{"title":"H20: Home to Overseas Conference, 2025 – Halifax, Nova Scotia","url":"https://www.youtube.com/watch?v=UvX0ddT8ZZo","date":1749577949,"author":"ACOACanada","guid":91,"unread":true,"content":"<article>Halifax is buzzing with ocean innovation! The H2O Conference is back—Canada’s biggest ocean tech event and a global hub for marine innovation. Powered by ACOA and hosted by the Ocean Technology Council of Nova Scotia, it all wraps June 12 with Cove Demo Day!\n#MarineTech #OceanInnovation\n\nTranscript\nSo H2O is a platform that we use to showcase our ocean technology sector.\nIt’s a way for our companies to come together and showcase their technologies and innovations and work with partners from around the world.\n\nThe conference has really grown and scaled over the last ten years.\n\nIt started out really as an industry showcase specifically for companies here in Nova Scotia.\n\nBut we've really grown it into an international conference with companies from all across Canada and around the world. \n\nHaving our international partners here is very important for the H2O conference and for our ocean technology sector as a whole.\n\nWe really have worked to turn H2O into an anchor event  that's on the calendar of international partners and members of the ocean tech sector\naround the world.\n\nSo for us the ocean technology sector is predominantly driven by export.\n\nSo about 80% of our company's revenues come from export.\n\nAnd with that we need to have partnerships; connections with our international markets.\n\nAnd the H2O conference is a way to kind of bring those partners in \nand showcase what we do best here in Atlantic Canada.</article>","contentLength":1438,"flags":null,"enclosureUrl":"https://www.youtube.com/v/UvX0ddT8ZZo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Cruise Canada and New England Symposium, 2025 - Halifax, Nova Scotia","url":"https://www.youtube.com/watch?v=Lz0uHkIgFDk","date":1749493709,"author":"ACOACanada","guid":90,"unread":true,"content":"<article>Cruise tourism is making a big impact in Atlantic Canada. With support from ACOA, the Atlantic Canada Cruise Association is helping local communities thrive — one port at a time. Discover how Halifax and our region are welcoming the world while fueling inclusive economic growth across the East Coast.\n\nTranscript\nHalifax, Nova Scotia is hosting the Cruise Canada and New England Symposium, where cruise leaders explore new ideas, technology and opportunities.\nCruise ships help anchor Atlantic Canada's economy. \nWith ACOA’s support, the Atlantic Canada Cruise Association champions our region as a top cruise destination, growing an industry that supports small businesses, boosts tourism, and enriches life in coastal communities.\nAnd in return we offer more than a stop. We share a story told through heritage, food, music and East Coast spirit.\nFrom our harbours to our hospitality, Atlantic Canada welcomes the world.</article>","contentLength":927,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Lz0uHkIgFDk?version=3","enclosureMime":"","commentsUrl":null}],"tags":["youtube"]}