{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppgUxX6mVe8tHAyUkjAqZKtHnCgGsdup","title":"TBS Canada","displayTitle":"TBS Canada","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCV7uvs-FoatgAuyzjpJTS3g","feedLink":"https://www.youtube.com/channel/UCV7uvs-FoatgAuyzjpJTS3g","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":3,"items":[{"title":"How can you find out where your tax dollars are spent?","url":"https://www.youtube.com/watch?v=hDEL_Xk9ONs","date":1763387270,"author":"TBS Canada","guid":43,"unread":true,"content":"<article>The Honourable Shafqat Ali, President of the Treasury Board, provides an overview of the responsability on transparency in government spending.\n\nVideo produced by: TBS Communications\nThis video is also available in French: https://youtu.be/u5rAMy9Sp2M\n\nTranscript:\n\nHow can you find out where your tax dollars are spent?\n\nEach year, federal departments publish a Departmental Plan outlining what they plan to do and what results they expect to achieve.\n\nAfter spending a year delivering programs and services to Canadians, they report on what they accomplished in a Departmental Results Report.\n\nBecause these programs and services cost money, the government also publishes the Public Accounts of Canada — essentially the government’s balance sheet. It’s a detailed document listing all government spending for the year. To ensure it is accurate and complete, it is audited by the Auditor General and tabled in Parliament for review.\n\nThis allows you — and your elected representatives — to see how your tax dollars are being used.\n\nFor more frequent updates on spending, departments publish Quarterly Financial Reports with a breakdown of spending over the previous three months, and they regularly disclose contracts, travel, and hospitality expenses.\n\nFor even more details, you can explore GC InfoBase and the Open Government Portal — two online transparency tools that make it easy to dive into the numbers yourself.\n\nThe Government of Canada is committed to transparency. It’s what keeps our democracy strong.</article>","contentLength":1529,"flags":null,"enclosureUrl":"https://www.youtube.com/v/hDEL_Xk9ONs?version=3","enclosureMime":"","commentsUrl":null},{"title":"How government spending gets approved","url":"https://www.youtube.com/watch?v=9yrRhT_YKI8","date":1762172372,"author":"TBS Canada","guid":42,"unread":true,"content":"<article>The Honourable Shafqat Ali, President of the Treasury Board, provides an overview of how government spending is approved.\n\nVideo produced by: TBS Communications\nThis video is also available in French: https://youtu.be/Ad9X7xhQbE4\n\nTranscript:\n\nHave you ever wondered how programs like Old Age Security, Child Care, and Dental Care are funded by your government?\nLet’s talk about how your tax dollars are used and how services are delivered to Canadians.\n\nEvery year, after hearing from Canadians, the Minister of Finance tables the federal budget in the House of Commons.\nThink of it as the government’s plan for the year ahead — what it wants to do and how it plans to pay for it.\n\nOnce the budget is announced and adopted by Parliament, federal departments work hard to turn the government’s agenda into detailed plans.\n\nBefore anything moves forward, the Treasury Board reviews these plans closely.\nIts role is to ensure that spending is cost-effective, focused on priorities, and delivers real results for Canadians.\n\nAfter these plans have been reviewed, refined, and approved, the President of the Treasury Board presents the Main Estimates — a detailed breakdown of how much money each federal organization is set to receive for the year.\n\nThe Estimates are updated up to three times a year through Supplementary Estimates, which reflect changes in priorities and address urgent needs.\n\nNext, Members of Parliament — your elected representatives — review these spending plans in committee.\nThey ask questions, dig into the details, and make sure everything adds up.\n\nWhen that is done, all MPs and Senators vote on the Estimates through a supply bill — a proposed law that authorizes the spending of government funds.\n\nOnce this bill is approved by Parliament, it receives Royal Assent, becoming law through what is known as an Appropriation Act.\nOnly then can departments access the funds they need to deliver programs and services to Canadians.\n\nIt’s a process that may seem complex, but it is built on transparency and accountability.\nYour government is committed to ensuring your tax dollars are spent wisely to protect the public services that matter most.</article>","contentLength":2186,"flags":null,"enclosureUrl":"https://www.youtube.com/v/9yrRhT_YKI8?version=3","enclosureMime":"","commentsUrl":null},{"title":"Treasury Board at a glance","url":"https://www.youtube.com/watch?v=50r3Yuqeats","date":1755794148,"author":"TBS Canada","guid":41,"unread":true,"content":"<article>This video is also available in French: https://www.youtube.com/watch?v=fKK5FauNZek\nVideo produced by: TBS Communications\n\nTranscript:\nThe Treasury Board is a Cabinet committee chaired by the President of the Treasury Board and composed of a Vice-Chair, four or more standing members, and alternate members.\nMinisters play a corporate role and do not represent their individual portfolios when they take part in meetings.\nThe Treasury Board of Canada Secretariat supports the Board administratively. It provides advice and recommendations.\nThe Treasury Board has two distinct functions known as Part A and Part B.\nFor Part A\nMinisters will consider proposals—Treasury Board submissions—from sponsoring ministers. \nThese submissions seek access to funding and/or authorities, such as the ability to enter into contracts or undertake projects, to advance the government’s agenda. \nTreasury Board also approves the ruleset governing financial and project management, contracting, and people and IT management in the government. \nAs the employer, Treasury Board will also be asked to approve collective agreements for the federal public service. \nTreasury Board considers about 350 proposals per year.\nFor Part B: \nThe Treasury Board also serves as the Governor in Council. It considers regulations and orders-in-council that are meant to protect the health, safety, or security of Canadians and the environment, and support a competitive and innovative economy.\nAnnually, the Treasury Board considers 100 to 200 regulatory proposals. \nIt also considers 200 to 300 non-regulatory orders-in-council including those that authorize Canada to enter into international agreements, or bring legislation into force. \nRegulations and orders-in-council are typically made public after approval.\nThe Treasury Board usually meets once a week when Parliament is sitting, or more frequently when there are many submissions to consider. Each meeting includes a Part A and a Part B agenda and typically lasts two to three hours.  \nEach Treasury Board submission, along with the Treasury Board Secretariat’s analysis and recommendation, is typically provided to ministers one week in advance of a Treasury Board meeting. \nA certain number of items are identified, or “flagged” in advance, because of their scope or profile, and are formally presented to Ministers at the meeting by senior officials from the Secretariat\nThe other items are proposed for approval without discussion; however, during the meeting ministers can ask questions on any item on the agenda.\nDecisions from Treasury Board are then communicated to departments so they can start implementation or address the Board’s concerns.</article>","contentLength":2691,"flags":null,"enclosureUrl":"https://www.youtube.com/v/50r3Yuqeats?version=3","enclosureMime":"","commentsUrl":null}],"tags":["youtube"]}