{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppgmZLYmxrbTRX3YNDP3muTT5pWvvtf2","title":"Competition Bureau Canada","displayTitle":"Competition Bureau Canada","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCWEkolOpjOruSK_lbGuhfVA","feedLink":"https://www.youtube.com/channel/UCWEkolOpjOruSK_lbGuhfVA","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":7,"items":[{"title":"Unlock your career potential - Insider insights from Tania Levy","url":"https://www.youtube.com/watch?v=WCRpzak34ok","date":1725044108,"author":"Competition Bureau Canada","guid":22,"unread":true,"content":"<article>Unlock your career potential, featuring Enforcement Support Officer Tania Levy.\n\nVersion française: https://youtu.be/ormd5M-_5dU</article>","contentLength":129,"flags":null,"enclosureUrl":"https://www.youtube.com/v/WCRpzak34ok?version=3","enclosureMime":"","commentsUrl":null},{"title":"Compliance Case Files: Mergers and Acquisitions","url":"https://www.youtube.com/watch?v=U7xUOlo8USo","date":1721843890,"author":"Competition Bureau Canada","guid":21,"unread":true,"content":"<article>Video on Mergers and Acquisitions. Part of the Compliance Bootcamp, a series of learning modules to help professionals stay on the right side of the law.\n\nDisponible en français au : https://youtu.be/tbD_njGdZP8\n\nhttps://competition-bureau.canada.ca/how-we-foster-competition/education-and-outreach/compliance-bootcamp</article>","contentLength":319,"flags":null,"enclosureUrl":"https://www.youtube.com/v/U7xUOlo8USo?version=3","enclosureMime":"","commentsUrl":null},{"title":"Compliance Case Files: Price-fixing","url":"https://www.youtube.com/watch?v=-xiJJmuT7LY","date":1721843883,"author":"Competition Bureau Canada","guid":20,"unread":true,"content":"<article>Disponible en français au: https://youtu.be/HfRQRHKw5-4\n\nVideo on avoiding price-fixing. Part of lesson 2 of the Compliance Bootcamp, a series of learning modules to help professionals stay on the right side of the law.\n\nhttps://competition-bureau.canada.ca/how-we-foster-competition/education-and-outreach/compliance-bootcamp</article>","contentLength":327,"flags":null,"enclosureUrl":"https://www.youtube.com/v/-xiJJmuT7LY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Implementing changes to the Competition Act (Bill C-59)","url":"https://www.youtube.com/watch?v=zs5xNHAqJ0M","date":1719330558,"author":"Competition Bureau Canada","guid":19,"unread":true,"content":"<article>Transcript\n\nVisual:\n\nTitle Card: Competition Bureau Canada / Bureau de la concurrence Canada – Implementing changes to the Competition Act\n\nSpeaker on-screen: Matthew Boswell, Canada’s Commissioner of Competition.\n\nAudio:\nThe Government of Canada has recently made a series of important changes to the Competition Act. \nThese changes give us stronger tools to take enforcement action and promote competition -- so that all Canadians can benefit from lower prices, better services, and more choice.   \nOver the coming months, we will be updating our guidance to give clarity on how and when we’ll take action under the new provisions of the law.   \nAs a part of this process, we will be holding a series of public consultations.  \n\nVisual: A group of 5 men and women speaking to each other around a table in an office setting.  The man on the left hands a stack of paperwork to the man in the middle. The scene then returns to Matthew.\n\nAudio:\nWe’re hoping to hear a wide range of perspectives, and we’ll carefully consider all of the feedback we receive. \nIn the meantime, we welcome any comments or suggestions that you’d like us to consider.   \nThese can be submitted through our new Guidance Feedback Form. \nWe look forward to hearing from you on these important changes to competition law in Canada. \n\nVisual: End card: Competition Bureau Canada / Bureau de la concurrence Canada accompanied by the Canadian Flag Government Identifier.</article>","contentLength":1451,"flags":null,"enclosureUrl":"https://www.youtube.com/v/zs5xNHAqJ0M?version=3","enclosureMime":"","commentsUrl":null},{"title":"AI generated scams","url":"https://www.youtube.com/watch?v=V0dWsv7sptA","date":1718818082,"author":"Competition Bureau Canada","guid":18,"unread":true,"content":"<article>Artificial intelligence is an exciting tool that can help us in our everyday lives, but fraudsters can also use it to make their frauds even more convincing. If you believe you’ve come across misleading AI generated content, report it to the Competition Bureau. For more information, check out our consumer alert: The rise of AI: Fraud in the digital age: https://www.canada.ca/en/competition-bureau/news/2024/03/the-rise-of-ai-fraud-in-the-digital-age.html\n\nTranscript\n\nTitle/Cover: AI generated scams \n\nScene 1: Audio\nSam finds AI technologies helpful for work and school. \n \nScene 1: Visual\nImage on-screen: Visual shows a figure on sitting in a coffee shop on a computer.\n\nScene 2: Audio\nBut here’s the thing: Fraudsters can also use AI to target Canadians. \n \nScene 2: Visual\nImage on-screen: Visual changes to close-up of computer screen. On the screen is a social media website and a video pops up on screen.  \n \nScene 3: Audio\nOne day, Sam spots a sponsored ad with their favorite celebrity endorsing a miracle skin care product.\n \nScene 3: Visual\nImage on-screen: The pop up video is enlarged. Visual of a celebrity figure appears on screen holding up a bottle. Stars appear around the bottle. \n \nScene 4: Audio\nSam is sold and ready to give it a try.\n \nScene 4: Visual\nImage on-screen: Visual changes to the figure looking at their computer screen and holding up a credit card. The figure focuses on the computer screen. \n \nScene 5: Audio\nBut after paying closer attention, they realize the person in the ad is a fake. Fraudsters can use AI to make fake images, audio, or videos of real people to sell you phony products.\n \nScene 5: Visual\nImage on-screen: Visual changes to the computer screen. The word “FAKE” appears next to the celebrity figure. The video zooms out to reveal the celebrity figure in the video is a puppet being controlled by a figure wearing a hoodie. The stars on screen fall. \n \nScene 6: Audio\nAlways pay close attention to content you see online before handing over your hard-earned money. \n \nScene 6: Visual\nImage on-screen: Visual changes to the figure looking at the computer screen focused.\n\nScene 7: Audio\nIf you come across deceptive content, report it to the Competition Bureau.\n\nScene 7: Visual\nImage on-screen: Visual of the Competition Bureau’s website on a laptop computer animates on screen with text that reads “Competition Bureau Canada”. Text that reads “Complaint Form” animates at the top of the computer screen in the search bar.</article>","contentLength":2499,"flags":null,"enclosureUrl":"https://www.youtube.com/v/V0dWsv7sptA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Fake Online Reviews and Subscription Traps","url":"https://www.youtube.com/watch?v=jy6e_TDoDYY","date":1716489929,"author":"Competition Bureau Canada","guid":17,"unread":true,"content":"<article>As social media and online shopping have become ever-present in our lives, we are increasingly exposed to the risk of being targeted by fraudsters. If you believe you have come across fake online reviews or have been misled by a free trial offer, report it to the Competition Bureau: https://competition-bureau.canada.ca/contact-competition-bureau-canada/complaint-form\n\nTranscript\n\nTitle/Cover: Fake Online Reviews and Subscription Traps \n\nScene 1: Audio\nMeet Alex.\n \nScene 1: Visual\nImage on-screen: Visual shows a figure on screen sitting sideways on a chair in their kitchen. The figure is browsing the internet on their smartphone.\n \nScene 2: Audio\nWhile browsing the internet, they found a streaming service with a one-time payment for exclusive content. \n \nScene 2: Visual\nImage on-screen: Visual changes to close-up of smartphone. Visual of an ad for a streaming app with 50K 5-star ratings with animated text that reads: “SeriousFlicks, Find Exclusive Shows Here”. Visual of the figure's index finger tapping the \"Reviews\" button on-screen. \n \nScene 3: Audio\nThe reviews were great, so they signed up.\n \nScene 3: Visual\nImage on-screen: Visual represents scrolling through a list of 5 star reviews and the figure's index finger tapping on the \"Subscribe\" button on-screen. 2 green dollar signs appear. \n \nScene 4: Audio\nThey soon discovered the service was lousy and the reviews were fake.\n \nScene 4: Visual\nImage on-screen: Visual changes to the figure visibly frustrated while shaking the smartphone. Visual changes to the smartphone screen with a buffering animation overtop a stream. Visual changes to the list of reviews with the word \"FAKE\" appearing next to all of them. \n \nScene 5: Audio\nAnd to their surprise, they had an ongoing subscription they never agreed to.\n \nScene 5: Visual\nImage on-screen: Close up of the smartphone and the figure's index finger repeatedly tapping the unsubscribe button. \n \nScene 6: Audio\nThis can happen to anyone.\n \nScene 6: Visual\nImage on-screen: Visual changes to the figure looking at their phone visibly angry. \n \nScene 7 Audio\nThe Competition Bureau enforces laws against deceptive marketing practices. If you suspect deceptive ads, report them to us.\n \nScene 8 Visual\nImage on-screen: Visual of the Competition Bureau’s website on a laptop computer animates on screen with text that reads “Competition Bureau Canada”. Text that reads “Complaint Form” animates at the top of the computer screen in the search bar.</article>","contentLength":2482,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jy6e_TDoDYY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Cryptocurrency Investment Fraud","url":"https://www.youtube.com/watch?v=QmLnUNA3iik","date":1711134402,"author":"Competition Bureau Canada","guid":16,"unread":true,"content":"<article>Investment fraud, including cryptocurrency fraud, takes many forms, but they all have one thing in common – the big lie that you can make tons of fast cash! If you believe you have been misled or think you’ve seen a cryptocurrency investment fraud, report it to the Competition Bureau: https://competition-bureau.canada.ca/contact-competition-bureau-canada/complaint-form\n\nTranscript \n\nTitle/Cover: Cryptocurrency Investment Fraud \n\nScene 1: Audio\nMeet Jo, like many Canadians…\n\nScene 1: Visual \nImage on-screen: Visual shows a figure on screen sitting sideways on a chair in their living room. The figure is scrolling through social media feed on their device.\n\nScene 2: Audio\n…they’re tempted by cryptocurrency’s fantastic financial potential.\n\nScene 2: Visual \nImage on-screen: Visual changes to close-up of scrolling, zoom in on a flashy investment ad with animated text that reads: “400% return in 2 weeks! Cancel anytime. INVEST NOW before it’s too late.” Visuals of crypto currency symbols display near the bottom of the screen. Hand animates into frame and a finger presses on the “INVEST NOW Before it’s too late” button.\n\nScene 3: Audio\nSeduced by promises of high profits and guaranteed returns, Jo takes the “plunge.”\n\nScene 3: Visual \nImage on-screen: Visual of the figure holding their mobile phone in one hand and in the other hand, their credit card to transfer funds. Animated text on the right side appears “- $15,000” in red with an arrow pointing down to animated crypto currency symbols to indicate that they are investing real money in cryptocurrency on the fraudulent platform.\n\nScene 4: Audio\nBut over time, Jo will realize that online ads exaggerated potential earnings and their guarantees were fake.\n\nScene 4: Visual \nImage on-screen: Visual of an arrow rises through graph with five-star reviews animate below with text that reads “Just made $10k in a week! That’s totally legit. $$” and text that reads “The ultimate crypto investment solution!!!”. As the visual of the arrow on the graph continues to rise, the word “FAKE” animates over the graph and gets bigger and smaller a few times as a alert warning to the viewer. \n\nScene 5: Audio\nIn the world of cryptocurrency…\n\nScene 5: Visual \nImage on-screen: Visual of the figure’s index finger clicking on a button with on screen text that reads “WITHDRAW”. \n\nScene 6: Audio\n…fraudsters are exploiting your lack of knowledge...\n\nScene 6: Visual\nOnce clicked, the button changes to red with animated text that reads “FAILED” on screen\n\nScene 7: Audio\n …with deceptive tactics like phony reviews and fake celebrity endorsements.\n\nScene 7: Visual\nImage on-screen: Scene changes to a close-up of the figure looking down at their mobile phone with a surprised expression on their face. Their expression quickly changes to a frown discovering that their money disappeared, they cannot withdraw the cryptocurrency they thought they purchased, and they have been defrauded.\n\nScene 8: Audio\nIf you come across misleading investment ads report them to the Competition Bureau.\n\nScene 8: Visual\nImage on-screen: Visual of the Competition Bureau’s website on a laptop computer animates on screen with text that reads “Competition Bureau Canada”. Text that reads “Complaint Form” animates at the top of the computer screen in the search bar.</article>","contentLength":3376,"flags":null,"enclosureUrl":"https://www.youtube.com/v/QmLnUNA3iik?version=3","enclosureMime":"","commentsUrl":null}],"tags":["youtube"]}