{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppcAkJboXbBkLNyQBrvWYH1pGPuMxJaC","title":"ACOACanada","displayTitle":"ACOACanada","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCFRoY5IvADtfCf1folzzc-A","feedLink":"https://www.youtube.com/channel/UCFRoY5IvADtfCf1folzzc-A","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"Cape Smokey – Ingonish, Nova Scotia","url":"https://www.youtube.com/watch?v=-_eUIa093dA","date":1738855701,"author":"ACOACanada","guid":15,"unread":true,"content":"<article>Cape Smokey ski hill in Cape Breton is upgrading its power systems from the mid-point to the top of the hill to meet growing energy needs, make more snow, and phase out diesel for cleaner air and less noise. \n\nTranscription\nCape Smokey is making more snow and more tourism opportunities with more efficient energy. New, modern power systems at the ski hill will help meet energy and snowmaking needs while replacing diesel, for cleaner air and less noise. \nInvesting in clean growth pays off:  new markets, more jobs, accelerated growth, while minimizing environmental impacts.  \nSMEs like Cape Smokey are leading the way by adopting new technologies and approaches to doing business.</article>","contentLength":684,"flags":null,"enclosureUrl":"https://www.youtube.com/v/-_eUIa093dA?version=3","enclosureMime":"","commentsUrl":null},{"title":"Bear River First Nation, N.S.","url":"https://www.youtube.com/watch?v=TgflBf32oz0","date":1733162237,"author":"ACOACanada","guid":14,"unread":true,"content":"<article>We’re grateful for projects that connect us to the earth and one another. Bear River First Nation, #Mikmaki is embracing those connections to drive economic development.</article>","contentLength":171,"flags":null,"enclosureUrl":"https://www.youtube.com/v/TgflBf32oz0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Town of Salisbury’s new amphitheatre - NB","url":"https://www.youtube.com/watch?v=0CvpVm1yA6c","date":1733161933,"author":"ACOACanada","guid":13,"unread":true,"content":"<article>Salisbury will soon host a variety of events, bringing people together in their new, vibrant community space. From concerts to community gatherings, the Salisbury amphitheatre is set to become a cornerstone of local entertainment and engagement. Plus, with the addition of a new trail system for walking and biking, there's even more to explore and enjoy. #gc \n\nTranscript:\nSo, we've had this dream for many, many years. But of course, it takes funding to do these types of things. \nAnd as a small community, we don't always have the resources to make these things happen. \nSo obviously when we approached ACOA with the idea and the relevance as well as the opportunities and the benefits for our community ACOA came forward obviously with funding.\nThe importance of the amphitheater as well as the connecting trail to our residents is something that they've been asking for for many, many years.\nAs Canada's most active community in 2023, we show that having a very connected community is important where people can walk trails and do recreational activities.\nThe amphitheater was one of those where we could bring people together in our community, connecting place where we can grow as one. And we're just so thrilled to have this happening in our community.</article>","contentLength":1260,"flags":null,"enclosureUrl":"https://www.youtube.com/v/0CvpVm1yA6c?version=3","enclosureMime":"","commentsUrl":null},{"title":"BioAccelerator Groundbreaking - PEI","url":"https://www.youtube.com/watch?v=M27SnLTJAww","date":1731526495,"author":"ACOACanada","guid":12,"unread":true,"content":"<article>Congratulations to the PEI BioAlliance on the official groundbreaking of the BioAccelerator! 🔬🧪🧬 \n\nLearn more about the new facility that is propelling the region’s bioscience cluster forward: https://peibioalliance.com/news/government-industry-partnership-breaks-ground-on-50-million-bioaccelerator/\n\nTranscript\nBIOACCELERATOR GROUNDBREAKING\n\nThe P.E.I. BioAlliance has broken ground on the BioAccelerator, a 60,000 sq. ft. facility that will provide essential infrastructure for the region’s bioscience and life sciences industry.\n\nExpected to be completed in 2026, the facility will be occupied by researchers, entrepreneurs, and bioscience-based companies.\n\nPEI’s bioscience community is widely recognized for its collaborative economic cluster model that drives innovation and sector growth.\n\nThe sector now includes 60 bioscience companies earning over $600 million annually in sales, making bioscience the second-largest industry in P.E.I.\n\nThe PEI Bioscience Cluster has surpassed 2025 growth targets and is well on its way to becoming a billion-dollar industry by 2030.\n\nACOA is proud to support this major advancement in Prince Edward Island’s bioscience innovation ecosystem!</article>","contentLength":1203,"flags":null,"enclosureUrl":"https://www.youtube.com/v/M27SnLTJAww?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Fredericton Pickleball Club - New Brunswick","url":"https://www.youtube.com/watch?v=gJNTOnFib2c","date":1730914403,"author":"ACOACanada","guid":11,"unread":true,"content":"<article>The Fredericton Pickleball Club is serving up community engagement and boosting the local economy with their accessible courts! #GC\nLearn more about this organization and how ACOA made a difference: https://www.canada.ca/en/atlantic-canada-opportunities/campaigns/impacts/fredericton-pickleball.html</article>","contentLength":299,"flags":null,"enclosureUrl":"https://www.youtube.com/v/gJNTOnFib2c?version=3","enclosureMime":"","commentsUrl":null},{"title":"Fall Food Tourism - PEI","url":"https://www.youtube.com/watch?v=o2cuCMibMNU","date":1730376993,"author":"ACOACanada","guid":10,"unread":true,"content":"<article>Fall is the perfect time to showcase the best of Prince Edward Island through food and music. The region is capitalizing on its distinct strengths and offering authentic cultural experiences to build a sustainable tourism industry that feels welcoming to everyone.</article>","contentLength":264,"flags":null,"enclosureUrl":"https://www.youtube.com/v/o2cuCMibMNU?version=3","enclosureMime":"","commentsUrl":null},{"title":"Port Charlottetown - PEI","url":"https://www.youtube.com/watch?v=UjyCbOcBGTY","date":1730376909,"author":"ACOACanada","guid":9,"unread":true,"content":"<article>Congratulations to Port Charlottetown on another busy cruise ship season, bringing in an estimated 167,000 visitors to Prince Edward Island in 2024. 🚢👋  #GC</article>","contentLength":162,"flags":null,"enclosureUrl":"https://www.youtube.com/v/UjyCbOcBGTY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Stratford Waterfront Gathering and Event Space - PEI","url":"https://www.youtube.com/watch?v=P8cEffqH_4k","date":1730376832,"author":"ACOACanada","guid":8,"unread":true,"content":"<article>The Town of Stratford recently announced the grand opening of the Stratford Waterfront Gathering and Event Space. This new infrastructure, supported through ACOA’s Innovative Communities Fund, is part of the community’s vision for a more inclusive, greener, and sustainable future.</article>","contentLength":285,"flags":null,"enclosureUrl":"https://www.youtube.com/v/P8cEffqH_4k?version=3","enclosureMime":"","commentsUrl":null},{"title":"Magnetic Hill Zoo - Moncton, NB","url":"https://www.youtube.com/watch?v=038i2UHTqmc","date":1730376732,"author":"ACOACanada","guid":7,"unread":true,"content":"<article>Ready for a wild adventure? 🦁🐾\nCheck out the @MagneticHillZoo, Atlantic Canada’s largest zoo! It is home to 70+ species and is sure to educate and inspire.</article>","contentLength":163,"flags":null,"enclosureUrl":"https://www.youtube.com/v/038i2UHTqmc?version=3","enclosureMime":"","commentsUrl":null},{"title":"Dartmouth Modernization news release","url":"https://www.youtube.com/watch?v=mz9ynzDzuso","date":1730376615,"author":"ACOACanada","guid":6,"unread":true,"content":"<article>Small businesses are powerful drivers of our economy, and this #SmallBusinessWeek, we’re highlighting four Nova Scotia companies receiving support to accelerate their growth and impact.</article>","contentLength":187,"flags":null,"enclosureUrl":"https://www.youtube.com/v/mz9ynzDzuso?version=3","enclosureMime":"","commentsUrl":null},{"title":"2024 Blk Women in Excellence Pitch Competition","url":"https://www.youtube.com/watch?v=FnWkwDK3vUg","date":1730376442,"author":"ACOACanada","guid":5,"unread":true,"content":"<article>Congratulations to the 17 Atlantic Canadian entrepreneurs who competed in Let’s Pitch It 2024 this month. Your ideas and ingenuity are a powerful force. You develop innovative products, deliver vital services, and drive economic growth all around you.</article>","contentLength":253,"flags":null,"enclosureUrl":"https://www.youtube.com/v/FnWkwDK3vUg?version=3","enclosureMime":"","commentsUrl":null},{"title":"NLOWE (Newfoundland And Labrador Organization of Women Entrepreneurs) 2024 Annual Conference","url":"https://www.youtube.com/watch?v=DFs1t-D093w","date":1728658414,"author":"ACOACanada","guid":4,"unread":true,"content":"<article>The Future is Now! 🔮👩🏽‍💼🌟\n\nNLOWE (@nlowe.org) hosted its 2024 Annual Conference last week in St. John’s, Newfoundland and Labrador, bringing together women entrepreneurs and business leaders from across the province.\n\nNLOWE empowers women by helping them start, grow, and advance in business. Congratulations to the NLOWE team on another successful event!\n\nSee inspirational highlights from the conference and learn how ACOA continues to support women in business:</article>","contentLength":483,"flags":null,"enclosureUrl":"https://www.youtube.com/v/DFs1t-D093w?version=3","enclosureMime":"","commentsUrl":null},{"title":"Maritime Gourmet Mushrooms - Great Village, NS","url":"https://www.youtube.com/watch?v=e7r5dLAIBz0","date":1728568999,"author":"ACOACanada","guid":3,"unread":true,"content":"<article>We grow when we help others grow.\n \nWhen Jason Giffin, President of Maritime Gourmet Mushrooms Inc., decided to move his business from Halifax to Great Village, NS, he discovered the #RuralAdvantage – a supportive network of farms, restaurants and retail businesses that helped him establish his operation.\n\nACOA is part of that network, helping @MaritimeGourmet expand to a new, larger facility in Debert. Now, Maritime Gourmet Mushrooms can help others in return.</article>","contentLength":467,"flags":null,"enclosureUrl":"https://www.youtube.com/v/e7r5dLAIBz0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Nova Scotia - World Tourism Day","url":"https://www.youtube.com/watch?v=Z-s1OYDsHMw","date":1727968105,"author":"ACOACanada","guid":2,"unread":true,"content":"<article>Winter hibernator or cold-weather adventurer: which one are you?\nWhatever the answer, a winter wonderland awaits you in Ingonish, Nova Scotia.\n \nLocals and visitors flock to the Cape Breton Highlands when the snow flies, and that’s why 4-season recreation and accommodation is growing in the region.</article>","contentLength":301,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Z-s1OYDsHMw?version=3","enclosureMime":"","commentsUrl":null},{"title":"Saltair Nordic Spa and Wellness - Canning, NS","url":"https://www.youtube.com/watch?v=jzsi3VVrWYw","date":1727967344,"author":"ACOACanada","guid":1,"unread":true,"content":"<article>Saltair Nordic is helping to extend the tourism seasonin the Annapolis Valley!\n\nWith support from ACOA, owners June Pardy and Jenny Sinclair were able to act on an idea to combine yoga and the spa experience. Saltair Nordic Spa and Wellness provides a local hub for the community and attracts visitors to the area year-round.</article>","contentLength":325,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jzsi3VVrWYw?version=3","enclosureMime":"","commentsUrl":null}],"tags":["youtube"]}