{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4JppgUxX6mVe8tHAyUkjAqZKtHnCgGsdup","title":"TBS Canada","displayTitle":"TBS Canada","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCV7uvs-FoatgAuyzjpJTS3g","feedLink":"https://www.youtube.com/channel/UCV7uvs-FoatgAuyzjpJTS3g","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Security Awareness (COR310)","url":"https://www.youtube.com/watch?v=Z2I0idihsAQ","date":1738945452,"author":"TBS Canada","guid":60,"unread":true,"content":"<article>To take the training: https://catalogue.csps-efpc.gc.ca/product?catalog=COR310&amp;cm_locale=en \nGeneral public access to the training: https://opn.csps-efpc.gc.ca/viewer/COR310-EN\n\nThis video was produced by the Communications team at the Treasury Board of Canada Secretariat.\n\nThis video is also available in French: https://youtu.be/5ZfM9VskZMY</article>","contentLength":343,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Z2I0idihsAQ?version=3","enclosureMime":"","commentsUrl":null},{"title":"GC Digital Talent Platform Instructional Video","url":"https://www.youtube.com/watch?v=8u8bWujSZio","date":1731703418,"author":"TBS Canada","guid":59,"unread":true,"content":"<article>The GC Digital Talent platform instructional video helps individuals create a profile and navigate through the process to apply for digital talent opportunities in the Government of Canada. \n\nThis video is also available in French: https://youtu.be/SD794Uv8K6A</article>","contentLength":260,"flags":null,"enclosureUrl":"https://www.youtube.com/v/8u8bWujSZio?version=3","enclosureMime":"","commentsUrl":null},{"title":"Stephen Burt, CDO of Canada, invites public servants to AccelerateGOV 2024","url":"https://www.youtube.com/watch?v=Cd79Km1NrYU","date":1724846425,"author":"TBS Canada","guid":58,"unread":true,"content":"<article>Stephen Burt, Chief Data Officer of Canada, invites public servants to attend AccelerateGOV conference in Ottawa on October 21, 2024.\nLearn from Canadian and international public service digital leaders. \nThis event is free for all public servants.\nRegister today: https://events.globalgovernmentforum.com/accelerategov24?lang=en (globalgovernmentforum.com)</article>","contentLength":357,"flags":null,"enclosureUrl":"https://www.youtube.com/v/Cd79Km1NrYU?version=3","enclosureMime":"","commentsUrl":null},{"title":"Open Government Week","url":"https://www.youtube.com/watch?v=2X5YxMXvBgI","date":1717510599,"author":"TBS Canada","guid":57,"unread":true,"content":"<article>Transcription:\n\nThe Government of Canada is dedicated to the principles of open government:\nTransparency, Integrity, Accountability, and Public participation.\n\nAnd to leveraging the open government portal as the door to sharing government information and data with Canadians.\n\nIncluding information on spending, access to information requests, and more!\n\nExplore open government!</article>","contentLength":379,"flags":null,"enclosureUrl":"https://www.youtube.com/v/2X5YxMXvBgI?version=3","enclosureMime":"","commentsUrl":null},{"title":"How does the government make sure that you get the best results from taxpayer dollars?","url":"https://www.youtube.com/watch?v=qMJ15PRQ2e4","date":1711122630,"author":"TBS Canada","guid":56,"unread":true,"content":"<article>How does the government make sure that you get the best results from taxpayer dollars? \nVideo produced by: TBS Communications\nThis video was recorded in a bilingual format, but the transcript is found in both languages below.\n\nComment le gouvernement obtient les meilleurs résultats possibles avec l’argent des contribuables?\nVidéo produite par : Communications du SCT\nCette vidéo a été enregistrée dans un format bilingue, mais la transcription se trouve dans les deux langues ci-dessous.\n\n---\n\nEnglish Transcription:\n\nHi everyone! Anita here. \nYou might wonder how the government makes sure that you get the best results from taxpayer dollars. \nThat’s my job as President of the Treasury Board.\nWe make sure that we have good management of our employees, of taxpayer dollars, and of technology.\nI chair the Treasury Board, Canada's oldest and only legislated Cabinet committee.\nThe Treasury Board reviews and approves spending plans proposed by departments and keeps an eye on how government programs are carried out to ensure accountability.\nThe Treasury Board is the employer of more than 250,000 employees across 70 organizations.\nIt is supported by a secretariat, which I also manage.\nThe Treasury Board Secretariat develops policies, and it sets out the strategic direction for the rest of the government in many areas of administration, including financial management, communications, people management, and regulations.\nWe are focussed on ensuring that:\n - Your tax dollars are managed carefully and focused on what matters most to you.\n - You have access to high-quality, modern, and reliable government services.\n - And that you can count on a high-performing, diverse, and dedicated public service that ensures that we are serving Canada and Canadians.\nIn short, we ensure that the government is well managed so that Canadians are well served.\nThank you for keeping me company today.\nOne more thing I love about being at Treasury Board, is that I get to interact and communicate with my colleagues every single day. I'm off to Treasury Board now, have a great day!\n\nTranscription en français :\n\nBonjour tout le monde! Ici Anita. Vous vous demandez peut-être comment le gouvernement obtient les meilleurs résultats possibles avec l’argent des contribuables? \nCela fait partie de mon travail en tant que présidente du Conseil du Trésor.\nJe veille, avec mon équipe, à la bonne gestion de nos effectifs, de l’argent des contribuables et de la technologie.\nJe préside le Conseil du Trésor, le plus ancien comité du Cabinet du Canada et le seul établi par la loi.\nLe Conseil du Trésor examine et approuve les plans de dépenses proposés par les ministères et surveille la manière dont les programmes gouvernementaux sont exécutés afin de veiller à la responsabilisation.\nLe Conseil du Trésor est l'employeur de plus de 250 000 fonctionnaires répartis dans 70 organisations.\nIl est soutenu par un secrétariat, que je dirige également.\nLe Secrétariat du Conseil du Trésor élabore des politiques et définit l’orientation stratégique pour le reste du gouvernement dans de nombreux domaines de l’administration, dont la gestion financière, les communications, la gestion des personnes et la réglementation.\nIl veille à ce :\n - que l’argent des contribuables soit géré avec soin et affecté à ce qui compte le plus pour vous;\n - que vous ayez accès à des services gouvernementaux de haute qualité, modernes et fiables;\n - que vous puissiez compter sur une fonction publique performante, diversifiée et dévouée, qui veille à ce que nous soyons au service du Canada et de sa population.\nBref, le SCT veille à ce que le gouvernement soit bien géré pour que la population canadienne soit bien servie.\nMerci de votre présence à mes côtés aujourd’hui.\nUne autre chose que j’aime bien de mon travail au Conseil du Trésor, c’est que j’ai l’occasion d’interagir et de communiquer avec mes collègues tous les jours. Je vous laisse à présent pour me rendre au Conseil du Trésor, et je vous souhaite une excellente journée!</article>","contentLength":4096,"flags":null,"enclosureUrl":"https://www.youtube.com/v/qMJ15PRQ2e4?version=3","enclosureMime":"","commentsUrl":null},{"title":"Happy International Women’s Day! Bonne Journée internationale de la femme!","url":"https://www.youtube.com/watch?v=tBAhOVsoj74","date":1709907160,"author":"TBS Canada","guid":55,"unread":true,"content":"<article>Video produced by: TBS Communications\nThis video was recorded in a bilingual format, but the transcript is found in both languages below.\n\nVidéo produite par : Communications du SCT\nCette vidéo a été enregistrée dans un format bilingue, mais la transcription se trouve dans les deux langues ci-dessous.\n\n---\n\nEnglish Transcription:\n\nEven when it seems impossible. Remember that women are breaking glass ceilings across our country and throughout our world, and you are no different. You can succeed too. \n\n[This year’s theme is “Invest in Women: Accelerate Progress”. What does this mean to you?]\nI work in STEM, specifically in cybersecurity. These fields tend to perpetuate a male-dominated culture. So, giving women greater access to pursue cybersecurity\neducation would help to accelerate progress. \nWe must work hard, but we must also have friends and laugh, because it’s important not only to achieve objectives and goals, but also to have friendships.\nWe must find concrete and relevant ways to support women, invest in them, and ensure their success. \n\n[Who inspired you to be a leader, and why?]\nDefinitely my mother. She used to tell us to reach for the stars, the world is our oyster, and her voice is always in my ear. Whenever I'm having a bad day, especially, as she really inspired me to keep on going.\n\n[What advice would you give to your younger self?]\nDon't be afraid to step outside of your comfort zone. Calculated risk can lead to growth and new opportunities. Also, don't fear failure. Instead, see it as a learning opportunity.\n\n[What words of wisdom do you have for the next generation of female leaders?]\nDon’t compare yourself to others. There is no one way to become a leader, and there is no singular mold to become a leader.  Do your best and always encourage others to do the same. Keep on trying. Never give up. Believe in yourself.\n\n--\n\nTranscription en français :\n\nMême lorsque cela semble impossible, rappelez-vous que les femmes brisent les plafonds de verre partout au pays et dans le monde entier, et vous ne faites pas exception. Vous pouvez réussir aussi. \n\n[Le thème de cette année est « Investir en faveur des femmes :  accélérer le rythme ». Qu'est-ce que cela signifie pour vous ?]\nJe travaille dans le domaine des STIM, plus particulièrement en cybersécurité. Ces domaines ont tendance à perpétuer une culture dominée par les hommes. Ainsi, le fait de donner aux femmes un meilleur accès aux études en cybersécurité permettrait d’accélérer les progrès. \nOn doit travailler fort, mais aussi on doit avoir des amis et de rire, parce que c'est important d'accomplir les objectifs de buts, mais aussi d'avoir des amis ensembles.\nNous devons trouver des moyens concrets et significatifs pour soutenir les femmes, investir en eux, et assurer leur réussite.\n\n[Qui vous a incité à devenir une leader, et pourquoi ?]\nSans aucun doute, ma mère. Elle nous disait d’atteindre les sommets, que le monde nous appartient. J’entends toujours sa voix. Lorsque je passe une mauvaise journée; \nsurtout qu’elle m’a vraiment encouragée à ne pas lâcher. \n\n[Si vous pouviez remonter le temps, quel conseil donneriez-vous à une plus jeune version de vous-même?]\nN’aie pas peur de sortir de ta zone de confort. Les risques calculés peuvent favoriser la croissance et ouvrir de nouvelles perspectives. Ne crains pas non plus l’échec. Vois-le plutôt comme une occasion d’apprentissage. \n\n[Quelles paroles de sagesse avez-vous pour la prochaine génération de femmes dirigeantes ?]\nNe vous comparez pas aux autres. Il n'y a pas de voie unique pour devenir un leader, et il n'y a pas de moule défini pour devenir un leader. Faites de votre mieux\net encouragez tout le temps les autres de faire le même. Tiens bon.  Ne baisse jamais les bras. Aie confiance en toi.</article>","contentLength":3847,"flags":null,"enclosureUrl":"https://www.youtube.com/v/tBAhOVsoj74?version=3","enclosureMime":"","commentsUrl":null}],"tags":["youtube"]}