{"id":"cyxkEVqiiLyCAwGTcKCgQJb6qK9AdzaCUe8ZniVJa7NHxvnMEfvzf1LfmcXA8PnCMxbsfsQDCYTuswiehqC4Y7kvWqpRNUyYbG5qAV8xAjxjtxsiqDyoagcCg9ZKKWYFXsZ","title":"Taxology – The Official Canada Revenue Agency Podcast","displayTitle":"Taxology – The Official Canada Revenue Agency Podcast","url":"https://www.canada.ca/content/dam/cra-arc/migration/cra-arc/esrvc-srvce/rss/txlgy-strmng-eng.xml","feedLink":"https://www.canada.ca/en/revenue-agency/news/cra-multimedia-library/podcasts.html","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Episode 11: Helping small businesses across the country through the Liaison Officer service","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-11-en.mp3","date":1770937200,"author":"","guid":10,"unread":true,"content":"<article>Being a small business owner or self-employed individual is a lot of work - meeting clients, fulfilling online orders, developing your business’s website, and much more. If you’re acting as the accountant for your business, you also keep your business records up to date for taxes. Did you know the Canada Revenue Agency (CRA) has a program to help you, for free? Through the CRA’s Liaison Officer service, you can get personalized support to help you understand your tax obligations. On this episode, a CRA liaison officer tells us all about the program. You’ll learn what’s involved in a typical meeting , what help an officer provides, and how to schedule your own personalized visit!</article>","contentLength":697,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-11-en.mp3","enclosureMime":"","commentsUrl":null},{"title":"Episode 10: Get help faster with the Canada Revenue Agency’s digital services","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-10-en.mp3","date":1765234800,"author":"","guid":9,"unread":true,"content":"<article>Canadians expect and deserve reliable and timely service from the Canada Revenue Agency (CRA). We understand that not knowing where to find the information you need can be frustrating. That’s why we’re dedicated to enhancing our services and simplifying the process for you. On this episode, our expert guest helps you handle your common tax and benefit tasks online. We’ll cover digital services and tools to get help faster, and new improvements that make it easier to manage your whole tax situation. Listen to this episode to learn the fastest way to change your address with the CRA, check the status of a file, chat online with a CRA agent, and much more!</article>","contentLength":667,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-10-en.mp3","enclosureMime":"","commentsUrl":null},{"title":"Episode 9: It pays to grow up: Tax tips when starting to work or starting post-secondary studies","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-9-en.mp3","date":1752102000,"author":"","guid":8,"unread":true,"content":"<article>Starting your first job or attending university or college? If so, congrats on the big life changes! This episode of Taxology will help you get ready. You may be wondering what your new situation means for your taxes. You may have to do them for the very first time. But don’t worry, we’re here for you! You’ll learn that not everyone has to pay at tax time. You could actually get more money back with a refund, and you could be eligible for benefits and credits. In this episode, we chat remotely with an expert who helps Canadians learn about their taxes and will share their knowledge with you!</article>","contentLength":604,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-9-en.mp3","enclosureMime":"","commentsUrl":null},{"title":"Episode 8: New Country, New Taxes: Info for Newcomers and International Students","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-8-en.mp3","date":1750719600,"author":"","guid":7,"unread":true,"content":"<article>If you are a newcomer or an international student (welcome!), this episode is for you. On top of learning the Canadian way of life, like managing the snow, ice skating, and how to pronounce poutine, you need to understand Canada’s tax system. Start here to find out about taxes in Canada and what benefit and credit payments you may be eligible for. Doing your taxes could help you. You may be able to claim education costs or get a tax refund, which is money in your pocket. Tax-free savings plans may also help you save for your future in Canada. Whether you’re a student starting your first year of post-secondary studies or a newcomer supporting your family this episode of Taxology will boost your tax literacy and give you the confidence to make informed tax decisions.</article>","contentLength":779,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-8-en.mp3","enclosureMime":"","commentsUrl":null},{"title":"Episode 7: Parenting Perks: About the Canada Child Benefit","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-7-en.mp3","date":1749682800,"author":"","guid":6,"unread":true,"content":"<article>For all you parents out there! Maybe you have a newborn, adopted a child, or have a new parenting situation. If you have a new child in your life, it’s important to let the Canada Revenue Agency (CRA) know since it can affect your taxes and benefits, like the Canada child benefit (CCB) On this episode of Taxology, a CRA expert explains the CCB, clarifies misconceptions and shares how you can apply. We can’t help you change diapers or build a crib, but we can help you get the benefits and credits you’re eligible for! So get that baby carrier on, and we will talk while you walk.</article>","contentLength":589,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-7-en.mp3","enclosureMime":"","commentsUrl":null},{"title":"Episode 6: Explaining the Disability Tax Credit","url":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-6-en.mp3","date":1748559600,"author":"","guid":5,"unread":true,"content":"<article>The disability tax credit (DTC) is a non-refundable credit that helps persons with disabilities who have a severe and prolonged physical or mental impairment affecting their daily lives. The credit can also help the family members who support the person with a disability to reduce the amount they may have to pay at tax time. In this episode, we chat with a CRA expert on the DTC, to help you understand the credit and the application process, and to clear up any misconceptions.</article>","contentLength":480,"flags":null,"enclosureUrl":"https://www.canada.ca/content/dam/cra-arc/newsroom/pdcsts/txlgy-episode-6-en.mp3","enclosureMime":"","commentsUrl":null}],"tags":[]}